{
    "keyword": "MSC Ship",
    "articles": [
        {
            "title": "MPS Terminal 3 breaks the all-time productivity record on MSC Livorno",
            "url": "https://thebftonline.com/2020/08/24/mps-terminal-3-breaks-the-all-time-productivity-record-on-msc-livorno/",
            "article_posted": "August 24, 2020",
            "categories": "Business, Companies, Headlines, Maritime, Top Headlines",
            "content": "Meridian Port Service (MPS) reached a new level of container-handling productivity on vessels by exceeding the previous record of 112 moves/hour which was achieved on MSC ALTAIR that berthed at Terminal 3 on May 15, 2020.\nThe new vessel productivity record of 139.91 moves/hour on MSC Livorno is from first lift to last lift, and operationally recognised as 145.86 moves/hour after adjusting the permissible deductible times. This has so far been logged as the All-Time Record for Tema Port, and is certainly by far best on the West African Coastline.\nMSC Livorno is flying the German Flag and is among a fleet of Ultra Large Container Vessels (ULCV) deployed on the MSC Africa Express (AFEX) weekly service into Ghana. Her capacity is 14,000 TEUs and Gross Tonnage of 153,115. Her length overall (LOA) is 366 metres and she is 51 metres wide.\nChief Execitive Officer of MPS Mohamed Samara remarked: “It has been identified by trade experts that one of the key factors for realising the Africa Continental Free Trade Area (AfCFTA) vision is development of significant trade and transport infrastructure.\n“MPS Terminal 3 is first among these infrastructures: our progressive service efficiency to shippers and consignees as well as superb vessels’ productivity levels have resulted in direct vessel calls with deep-drafted vessels (avoiding hubs), hence shorter transit times.”\nWith MPS Terminal 3 positioning itself as an effective transhipment hub providing connectivity between the seaports of Africa and hinterland markets, Ghana through this will be at the lead for Africa in reducing to the barest minimum existing intra-continental trade barriers. This will boost economic development and fit the continent to harness all the diversified economic benefits inherent in the AfCFTA.\nHe described the recent record-breaking accomplishment as a stellar performance by the operations team. “We are proud to achieve this milestone with no incidents or accidents, respecting all safety protocols, and for creating a worthy safety culture that safeguards all workers and company assets.\n“On behalf of the shareholders, board and management of MPS, I would like to take this opportunity to congratulate the entire MPS team, especially the operations management, supervisors, planners, equipment & crane operators, truck drivers and all the support team that worked on the vessel,” said Mr. Samara.",
            "social_links": {
                "facebook": "https://www.facebook.com/sharer.php?u=https%3A%2F%2Fthebftonline.com%2F2020%2F08%2F24%2Fmps-terminal-3-breaks-the-all-time-productivity-record-on-msc-livorno%2F",
                "twitter": "https://twitter.com/intent/tweet?text=MPS+Terminal+3+breaks+the+all-time+productivity+record+on+MSC+Livorno&url=https%3A%2F%2Fthebftonline.com%2F2020%2F08%2F24%2Fmps-terminal-3-breaks-the-all-time-productivity-record-on-msc-livorno%2F&via=bftghana",
                "whatsapp": "https://api.whatsapp.com/send?text=MPS+Terminal+3+breaks+the+all-time+productivity+record+on+MSC+Livorno %0A%0A https://thebftonline.com/2020/08/24/mps-terminal-3-breaks-the-all-time-productivity-record-on-msc-livorno/"
            },
            "images": [
                "https://i0.wp.com/thebftonline.com/wp-content/uploads/2020/08/PastedGraphic-1-17.png?fit=214%2C143&ssl=1"
            ],
            "tags": "Meridian Port Service (MPS), MSC Africa Express (AFEX), MSC Altair, Terminal 3, Ultra Large Container Vessels (ULCV)",
            "source": "thebftonline.com"
        },
        {
            "title": "Prof. Adei to Speak on Leadership and Nation Building at NGBL Awards",
            "url": "https://thebftonline.com/2021/08/11/prof-adei-to-speak-on-leadership-and-nation-building-at-ngbl-awards/",
            "article_posted": "August 11, 2021",
            "categories": "Business, Companies, Education",
            "content": "The former Rector for GIMPA and the current board chairman of the Ghana Revenue Authority, Professor Stephen Adei, will be the special guest of honour and keynote speaker for the 2021 National Governance and Business Leadership Awards slated for Friday, 13\nth\n August, 2021 at the plush Labadi Beach Hotel, Accra at 6pm prompt.\nThe event will also celebrate political governance personalities as well as business leadership personalities, including board chairmen, chief executives, human resources directors, communications managers and business organizations across Ghana.\nProfessor Stephen Adei, Companion of the Order of the Volta holds a PhD in international economics (University of Sydney, Australia), MSc in development economics (University of Strathclyde, UK), BSc economics (University of Ghana), Bachelor of Divinity (UK), Master of Theology (University of South Africa). He is a chartered marketer, chartered company secretary and has a diploma in marriage counselling. He has expertise in leadership, governance, public management, finance, economics, marketing and marriage counselling.\nSince 2013 has been with Ashesi University College where he is currently Dean of Arts and Sciences and Professor of Leadership and Economics, after being with Pentecost University College, Accra from 2009 to 2013.\nBetween January 2000 and December 2008, Prof. Adei was director-general and Rector of the Ghana Institute of Management and Public Administration (GIMPA). Under his leadership, GIMPA was transformed from a small, under-resourced and subvented institute into the most successful organisation under the government of Ghana’s public sector reforms.\nPrior to that he was head of the United Nations System in South Africa (September 1994-February 1995), \nUN Development Programme\n Resident Representative in Namibia (1995-1999), senior economist and chief of the directorate of the Africa Bureau, UNDP, New York (1989-1995); senior economist of the Commonwealth Secretariat, London (1986-1989) and staff member of the Capital Investments Board (now Ghana Investment Promotion Centre – GIPC) rising to deputy director and head research (1973-1985).  In 1971, he was an assistant economist in the Ministry of Finance of Ghana. He has taught economics at the University of Ghana and University of Sydney and undertaken several consultancy assignments.\nProf. Adei has served on several national and international bodies including: board chairperson of Ghana Broadcasting Corporation; board member, Kofi Annan Centre for Excellence in Information and Communications Technology; president, Chartered Institute of Marketing (Ghana); member, Global Foundation of Management Education (Montreal, Canada); member, Council of the Association of African Public Administrators and Management (AAPAM); board member, Commonwealth Association of Public Administrators and Management (CAPAM); president, Ghana Red Cross Society; member, Environmental Protection Council; and member, Advisory Board of the Ministry of Finance. He is currently chairperson and/or member of several institutions, companies and not-for-profit organisations including the Judicial Council, Accra College of Medicine and Ghana Christian International High School (a top-rated school which he co-founded with his wife, Mrs. Georgina Adei) .\nHe is the author and co-author of more than 20 books and 8 book chapters. He has also written more than 100 articles, keynote addresses and papers.\nABOUT NATIONAL COMMUNICATIONS SUMMIT 2019\nThe National Governance & Business Leadership Awards is a C-level high-impact, economic empowerment and leadership awards programme developed by RAD Communications to champion good governance, economic empowerment and job creation in Ghana. The event will recognize and celebrate companies, organizations and individuals excelling across Ghana.\nKindly call RAD on 0247415140, email \n[email protected]\n or visit \nwww.ngblaghana.com\n to reserve your seat.",
            "social_links": {
                "facebook": "https://www.facebook.com/sharer.php?u=https%3A%2F%2Fthebftonline.com%2F2021%2F08%2F11%2Fprof-adei-to-speak-on-leadership-and-nation-building-at-ngbl-awards%2F",
                "twitter": "https://twitter.com/intent/tweet?text=Prof.+Adei+to+Speak+on+Leadership+and+Nation+Building+at+NGBL+Awards&url=https%3A%2F%2Fthebftonline.com%2F2021%2F08%2F11%2Fprof-adei-to-speak-on-leadership-and-nation-building-at-ngbl-awards%2F&via=bftghana",
                "whatsapp": "https://api.whatsapp.com/send?text=Prof.+Adei+to+Speak+on+Leadership+and+Nation+Building+at+NGBL+Awards %0A%0A https://thebftonline.com/2021/08/11/prof-adei-to-speak-on-leadership-and-nation-building-at-ngbl-awards/"
            },
            "images": [
                "https://i0.wp.com/thebftonline.com/wp-content/uploads/2021/08/GUEST-OF-HONOUR-e1628611309336.jpg?fit=885%2C882&ssl=1"
            ],
            "tags": "leadership and nation building, National Governance and Business Leadership Awards, NGBL Awards, Prof. Adei to Speak on Leadership and Nation Building at NGBL Awards, Professor Stephen Adei",
            "source": "thebftonline.com"
        },
        {
            "title": "AGRA in Ghana: a successful 16-year partnership",
            "url": "https://thebftonline.com/2022/04/27/agra-in-ghana-a-successful-16-year-partnership/",
            "article_posted": "April 27, 2022",
            "categories": "Business, Agribusiness, Features, Headlines, Top Headlines",
            "content": "With the right reform in our agricultural sector, we can grow the economy, create more jobs and attain food security. And while government has achieved and continues to achieve significant gains toward this vision, we can’t do it alone; but we need to ensure these partnerships are fit for purpose and make sense for the country.\nAn example of this is our partnership with AGRA, who has supported us to improve the enabling environment for smallholder farmers, while delivering the technical and structural reforms needed to help grow agricultural sector.\nAGRA arrived in Ghana in 2006, and during its first decade, it invested US$12.8million in our national agricultural sector. That this has borne fruit can be established by looking at some of the results of this investment.\nThe establishment of 11 seed companies has been supported, as was the development and release of 45 seed varieties, of which 36 went on to be commercially developed. AGRA helped 20 people achieve PHDs and 27 to be awarded MSCs.\nIt trained 4,132 agricultural dealers, which meant the distances farmers had to travel to get access to inputs, such as seeds and fertiliser were reduced. It educated 702,000 farmers on the techniques of Integrated Soil Fertility Management (ISFM), a process that mixes mineral and organic fertilisers and aims to maximise the utility of scarce nutrient resources.\nAs a result, 212,000 hectares have been cropped using ISFM technologies. AGRA’s intervention has resulted in 122,000 metric tonnes of harvests commercially gathered in, valued at US$23million.\nAGRA contributed to the development and passage through the political process of regulations connected with the Plants and Fertiliser Act, a measure to ensure the efficient conduct of plant protection, to prevent the introduction and spread of plant pests, to regulate the import, and facilitate the export of plants and plant materials.\nIt contributed also to Ghana’s National Fertiliser Policy, and promoted the Seed (Certification and Standard) Regulation, which has been passed by Ghana’s Parliament.\nAll of this is of critical importance in a country where half the people reading this article work in agriculture. We cannot underestimate the challenge of enhancing a sector that accounts for more than half our gross domestic product.\nAGRA’s initiatives are in no sense in competition with official government policy. On the contrary, its work has been fully in line with the state’s two main programmes in this sector, the Food and Agriculture Sector Development Policy (FASDEP II) and the second phase of the Medium Term Agriculture Sector Investment Plan (METASIP II).\nLike government, AGRA is committed to increasing incentives for private-sector investment and participation in agriculture, while improving access for Ghanaian farmers to both finance and markets. We are both committed to encouraging the adoption of climate-smart technologies and the use of climate-adapted seeds and fertilisers.\nAGRA has improved the incomes and the food security of at least 1.2million smallholder households, and has facilitated the development of a ‘smart subsidy’ model to encourage the adoption of yield-enhancing technologies.\nOn the ground, 1,880 village-based advisers have been recruited and trained, and a partnership established to implement the National Rice Development Strategy – aimed at increasing the capacity of more than 128,000 farmers.\nAGRA’s work takes it into many and complex areas, but its rationale is quite simple. It is to transform the working lives of primarily smallholder farmers – men and women typically cultivating staple crops on land measuring two hectares or less, by turning what had been a daily struggle, to survive into a thriving small business. In this fine and praiseworthy endeavour, AGRA has been a true friend to Ghana.\n \nDr. Owusu Afriyie Akoto\n is Minister of Food and Agriculture",
            "social_links": {
                "facebook": "https://www.facebook.com/sharer.php?u=https%3A%2F%2Fthebftonline.com%2F2022%2F04%2F27%2Fagra-in-ghana-a-successful-16-year-partnership%2F",
                "twitter": "https://twitter.com/intent/tweet?text=AGRA+in+Ghana%3A+a+successful+16-year+partnership&url=https%3A%2F%2Fthebftonline.com%2F2022%2F04%2F27%2Fagra-in-ghana-a-successful-16-year-partnership%2F&via=bftghana",
                "whatsapp": "https://api.whatsapp.com/send?text=AGRA+in+Ghana%3A+a+successful+16-year+partnership %0A%0A https://thebftonline.com/2022/04/27/agra-in-ghana-a-successful-16-year-partnership/"
            },
            "images": [
                "https://i0.wp.com/thebftonline.com/wp-content/uploads/2022/04/owusu-afriyie-akoto.jpg?fit=750%2C500&ssl=1"
            ],
            "tags": "AGRA, AGRA in Ghana: a successful 16-year partnership",
            "source": "thebftonline.com"
        },
        {
            "title": "MSC Natasha calls at MPS Terminal 3 with 2,200 containers",
            "url": "https://thebftonline.com/2020/12/03/msc-natasha-calls-at-mps-terminal-3-with-2200-containers/",
            "article_posted": "December 3, 2020",
            "categories": "Business, Companies, Economy, Headlines, Maritime, Top Headlines, Trade",
            "content": "Meridian Port Services Limited (MPS), the leading Container Terminal/Port in West Africa, has achieved another milestone by successfully receiving MSC Natasha which loaded about 2,200 containers at Tema Port.\nThe MSC Natasha started her voyage from the Far East port of Dongguan Anch in the early hours of 14\nth\n October and stopped at several ports – starting with a 21-hour call at Chiwan on 15th October, then a 1 day – 10 hours stay in Singapore on the 22nd October, followed by a 13-hour stop in Colombo on 27\nth\n October.\nShe then proceeded on a direct call to West Africa, going around the Cape of Good Hope, stopping at Lomé on the 12\nth\n of November and arriving in Tema on 18\nth\n November at 0600h and sailed by midday on 19\nth\n November.\nBesides the many thousands of containers which had been loaded and offloaded at the various port stops, the MSC Natasha discharged and loaded at MPS Terminal 3 a total of 3,524 TEUs of gateway volume to Ghana and the neighbouring landlocked countries; but more interestingly, MSC Natasha brought with her 2,200 TEUs which belong to South America.\nThe 2,200 TEUs of transhipment containers will stay at MPS Terminal 3 for a few days and then be loaded onto MSC ALBANY for shipping to the respective final country of destination in South America (mainly Brazil).\nMSC Natasha was built in 2011 and her length overall (LOA) is 366m, beam is 48m. Her Gross Tonnage is 141,649 tonnes with container capacity of 13,556 TEUs. She is one of 15 vessels operated by MSC on this Far East-West Africa weekly service that enjoys a berthing window arrangement at MPS’ Terminal 3.\nT\nranshipment at the centre of the world\nIt was in 1884 that the Greenwich Meridian was established at the International Meridian Conference held in October 1884 at Washington, D.C., as the line of zero Longitude, forming the basis for navigation and time-keeping throughout the world.\nRunning from the North to the South Pole and separating the Eastern Hemisphere from the Western, this Prime Meridian Line (0° E/W) passes through the centre of the Harbour Basin of MPS Terminal 3 at Tema Port, which is the closest point on Earth to the Centre of the World – where the Greenwich Meridian Line (zero-degree longitude) crosses with the Equator Line (zero-degree latitude).\nMPS, by virtue of its location at the centre of the world as well as its commitment to continuous improvement in infrastructure, superstructure and the service levels, provides stakeholders the best of the world’s technology to boost its operations.\nFurthermore, it superb investment in creating valuable opportunity to the shipping lines has been put to good use in connecting continents and effectively serving markets, thanks to the enabling infra & superstructure of MPS Terminal 3.\nChief Executive Officer of MPS, Mohamed Samara, mentioned some of the key developments at MPS Terminal 3 that led to Port Tema attaining the status of a shipping hub: “The efficiency, accessibility, the short waiting time at anchorage, fast vessel turnaround time, higher port capacity and berth availability are the optimal criteria for making Terminal 3 a hub on the west coastline of Africa. Moreover, MPS Terminal m3 has the best synchronised frequency of calls (berthing Windows), number of shipping lines and highest volume per vessel call in West Africa, making it the ideal first port of call with the shortest trade transit time and transhipment facilities,” said Mr Samara.\nMeridian Port Services Limited\n (MPS) is a joint venture between the Ghana Ports and Harbours Authority and Meridian Port Holdings Limited, with Bolloré Transport & Logistics and APM Terminals. MPS is the region’s most efficient Container Terminal, providing shipping lines with the highest productivity levels (discharge/load), with a real-time electronic data interchange using top-notch Terminal Operating Systems\n.",
            "social_links": {
                "facebook": "https://www.facebook.com/sharer.php?u=https%3A%2F%2Fthebftonline.com%2F2020%2F12%2F03%2Fmsc-natasha-calls-at-mps-terminal-3-with-2200-containers%2F",
                "twitter": "https://twitter.com/intent/tweet?text=MSC+Natasha+calls+at+MPS+Terminal+3+with+2%2C200+containers&url=https%3A%2F%2Fthebftonline.com%2F2020%2F12%2F03%2Fmsc-natasha-calls-at-mps-terminal-3-with-2200-containers%2F&via=bftghana",
                "whatsapp": "https://api.whatsapp.com/send?text=MSC+Natasha+calls+at+MPS+Terminal+3+with+2%2C200+containers %0A%0A https://thebftonline.com/2020/12/03/msc-natasha-calls-at-mps-terminal-3-with-2200-containers/"
            },
            "images": [
                "https://i0.wp.com/thebftonline.com/wp-content/uploads/2020/12/msc.jpg?fit=1598%2C1065&ssl=1"
            ],
            "tags": "Meridian Port Services Limited, MPS, MSC Natasha",
            "source": "Evelyn Arthur, Tema"
        },
        {
            "title": "LEC Group to kick start 2022 National Youth Mentorship summit, July 23",
            "url": "https://thebftonline.com/2022/07/13/lec-group-to-kick-start-2022-national-youth-mentorship-summit-july-23/",
            "article_posted": "July 13, 2022",
            "categories": "Editors' picks, News",
            "content": "LEC Group, with its partners, is set to kick start the 2022 National Youth Mentorship summit on Saturday, July 23 to empower the youth and guide them on leveraging opportunities. It also seeks to provide career guidance and counselling, work-based learning, coaching, and mentoring to provide participants with the skills required for employment.\nThe summit, with the theme: ‘Developing an Enterprising Youth’, will take place on July 23, 2022, at 8 am at the Great Hall of Kwame Nkrumah University of Science and Technology (KNUST) in Kumasi. The event will also take place in Accra on August 27, 2022 at 8 a.m. at the University of Ghana – Legon, and finally in Cape Coast on September 3, 2022 at the University of Cape Coast, NEC Auditorium.\nThe programme partners with Adom FM & TV, Asempa FM, Brandeis International Business School (USA), Regional Ministries, and Role Model Africa.\nThe summit promises to bring exciting yet educating topics facilitated by seasoned speakers on the thematic areas. These speakers are experts and individuals with first-hand experience in their various fields.\nSpeakers\nThe CEO of LEC Group, Albert Kusi\n. He is a successful entrepreneur, public speaker, and a youth development activist. In the past decade, he has been instrumental in shaping the youth of Ghana through the LEC Group, an organisation of affiliated human development interventions. He has received global recognition through notable awards schemes, including being named one of the 50 most influential Ghanaians under 40 for three years.\nPrince Kofi Amoabeng\n is a Ghanaian businessman and a former military officer of the Ghana Armed Forces. He was a co-founder of UT Bank and owned numerous companies in Ghana. He has received many awards, including the Lifetime Achievement for Innovation in Africa (2013).\nJohn Dumelo\n is an actor of international recognition and an entrepreneur who has expressed his knack for business through his interest in various fields. He is also known for his political aspirations and his ventures in crop and animal farming.\nManaging Director of Prudential bank, Mr. John K. Addo\n has over thirty (30) years of rich corporate experience in banking and finance, having worked with reputable institutions in the United Kingdom and Ghana. He is a Chartered Accountant by training and a Fellow of the Institute of Chartered Accountants in England and Wales (ICAEW).\nPhilip Osei Bonsu\n is the Host of Ekosiisen and the head of programmes at Asempa FM. He is also the head of Public Relations for the Electricity Company of Ghana in the Western Region. The 2017 Mandela Washington Fellow is a Tullow Scholar who holds an MSc in Corporate Communication and Public Affairs from Robert Gordon University in Aberdeen.\nHilda Nimo Tieku\n works as a Chief Executive Officer at Jobberman – Ghana’s leading platform for talent acquisition founded in 2012, and with an estimated 40 employees. Hilda is a focused Business Development Manager with over fourteen years of experience in exceptional planning and strategic implementation.\nStudents and workers alike from all institutions in Ghana and beyond can be a part of this mega event. Kindly fill out this form below to reserve a seat at Ghana’s Biggest Mentorship Conference in any of the 3 locations (Accra, Kumasi & Cape Coast).",
            "social_links": {
                "facebook": "https://www.facebook.com/sharer.php?u=https%3A%2F%2Fthebftonline.com%2F2022%2F07%2F13%2Flec-group-to-kick-start-2022-national-youth-mentorship-summit-july-23%2F",
                "twitter": "https://twitter.com/intent/tweet?text=LEC+Group+to+kick+start+2022+National+Youth+Mentorship+summit%2C+July+23&url=https%3A%2F%2Fthebftonline.com%2F2022%2F07%2F13%2Flec-group-to-kick-start-2022-national-youth-mentorship-summit-july-23%2F&via=bftghana",
                "whatsapp": "https://api.whatsapp.com/send?text=LEC+Group+to+kick+start+2022+National+Youth+Mentorship+summit%2C+July+23 %0A%0A https://thebftonline.com/2022/07/13/lec-group-to-kick-start-2022-national-youth-mentorship-summit-july-23/"
            },
            "images": [
                "https://i0.wp.com/thebftonline.com/wp-content/uploads/2022/07/nationa.jpg?fit=900%2C750&ssl=1"
            ],
            "tags": "LEC Group",
            "source": null
        },
        {
            "title": "Roberta Annan writes…… Women in Leadership: Achieving an equitable future in a COVID-19 world",
            "url": "https://thebftonline.com/2021/03/11/roberta-annan-writes-women-in-leadership-achieving-an-equitable-future-in-a-covid-19-world/",
            "article_posted": "March 11, 2021",
            "categories": "B&FT TV, COVID-19, Features, Headlines, Top Headlines",
            "content": "The recent announcement of Dr. Ngozi Okonjo-Iweala as the new Director General of the World Trade Organisation will forever be remembered in the annals of history – the first woman and African to be chosen as Director General. Achieving this feat did not come easy, as it was fraught with a number of challenges.\nHer appointment as the WTO DG was received with so much euphoria across the globe, especially for women and Africans – finally, a woman had been given the nod to lead WTO’s efforts in implementing reforms and policies in a bid to revamp the global economy amid the COVID-19 pandemic. More significant was the fact that this powerhouse is an African.\nUnarguably, Ngozi Okonjo-Iweala has built an enviable track record in a career that spans over three decades in trade, finance, government, international relations and diplomacy, among others. Having had the rare privilege of meeting her a few years ago, I have witnessed first-hand her brilliance, tenacity and passion for Africa’s growth.  A woman of many firsts, her rise didn’t occur by mere happenstance.\nIn a world where women are sidelined and overlooked, she has had to ‘fight’’ her way through. Having spent a 25-year career at the World Bank as a development economist, she was the first woman to run for presidency at the World Bank. She also served two terms as Finance Minister of Nigeria under President Olusegun Obasanjo and President Good Luck Jonathan respectively.\nShe was the first woman to serve as the country’s finance minister, the first woman to serve in that office twice, and the only finance minister to have served under two different presidents. In 2005, she was named ‘Global Finance Minister of the Year’ by Euromoney.\nOftentimes, women have faced a lot of criticism and backlash in business and leadership simply because they are women – and it gets even worse when they are women of colour. Women face a lot of stereotypes when they take on leadership positions. They face varying challenges including lack of support and intimidation. Okonjo-Iweala’s story is no different. Several attempts were made by certain factions to thwart her candidacy for the top job at the WTO; her credibility was questioned, and her capabilities undermined.\nVice President Kamala Harris’ candidacy was also questioned and even ridiculed at several points during the US presidential campaign trail. From snide and unsavory remarks about her identity and competence, Harris – America’s highest-ranking female official in U.S. history and the first African-American and Asian-American Vice President – has also been a victim of racism and injustice. Despite these challenges their feats have brought hope to many people, especially young women and girls across the world, to dream and believe it’s possible.\nThere is a need for more women to assume leadership roles to build a stronger post-pandemic world. According to U.N. Women, only 22 countries have an elected woman head of state or government, while 119 nations have never had a woman leader.\nData also indicate that at the current rate, parity will not be reached in national parliaments before 2063, and in ministerial positions before 2077. At the beginning of 2020, only 14 countries had Cabinets in which women held at least half the posts. They included Rwanda, Finland, Canada, Colombia and Peru. Currently, America’s Cabinet is one of the most diversified and gender balanced.\nIn an article published by the World Economic Forum, Phumzile Mlambo-Ngcuka – who made history as South Africa’s first female deputy president in 2005 – noted that gender-balanced Cabinets made better decisions not just for women but society as a whole.\nIt is sad that even in these modern times, women continue to face social injustices, racism, sexism, cultural appropriation, micro-aggression, gender inequality, entrenched social norms, police brutality among others. Many African women and those within the BAME community and other ‘minorities’ have experienced several incidences of discrimination, and have been denied access to a lot of opportunities simply because of the colour of their skin.\nThe issue of diversity and inclusion has become an all-important discussion as the world intensifies efforts in the fight against gender disparity and inequality. While I was undertaking my MSc in Biotechnology a few years ago, I observed a very worrying trend – my experience in academia mirrored my experience in the corporate world to a large extent.\nOn several occasions, I have found myself as one of the few women in the room – a bad narrative that needs to be challenged.\nRegrettably, the level of women’s representation across the sub-Saharan region is still at an all-time low. While the region has seen an increase in the representation of women in certain fields, they are yet to break through in certain areas that are widely seen as male-dominated sectors.\nGrowing backlashes and the many other barriers women face in leadership, governance, politics etc. continue to pose serious challenges. It is a normal occurrence for men to be considered for managerial positions as against women.\nPredominantly, this is as a result of discriminatory social norms which have tended to be informed by perceptions of leadership being considered as solely reserved for men. These norms continue to shape organisational cultures and practices. Additionally, many women face challenges balancing their work with other responsibilities; and in some situations, some have been forced to choose their family – causing implications for their prospects of career progression.\nIn the face of the COVID-19 pandemic, we have witnessed the immense contributions women have made toward combatting the pandemic’s ravaging effects. New Zealand’s Jacinda Ardern and Germany’s Angela Merkel have received worldwide praise for their approach and response to managing the COVID-19 crisis.\nThe crisis underscored the essence of their contributions and the disproportionate burdens women face. Undoubtedly, women leaders have demonstrated their capacity to effectively lead in the COVID-19 response and recovery efforts worldwide. The pandemic has also highlighted the role of women leadership in promoting the diversity and inclusion agenda toward developing an effective pandemic response approach.\nThis will help us re-emphasise the importance of advancing women’s leadership and participation in decision-making as a key component to advance the 2030 Agenda for Sustainable and the Sustainable Development Goals (SDGs), especially in addressing the potential long-term effects of COVID-19.\nMore women need to be given the opportunity to lead, take charge and build a more resilient world – especially in these times. We need to steer conversations targetted at promoting women empowerment, women inclusivity and leadership. Diversity and inclusion have proven to be key drivers for sustainable growth and the game-changer for a well-functioning market economy.\nWe need to position women in diverse business ecosystems to gain access to opportunities, access finance and assets, establish and lead businesses, and participate in critical decision-making processes. As stakeholders, the duty lies on us to discuss practical strategies that can enhance women inclusivity within Africa and beyond.\nThere is a need for inclusive participation by policymakers, civil society, activists, academia and other stakeholders to contribute in achieving gender equality and women empowerment, both locally and internationally.  The Commission on the Status of Women, dedicated to the promotion of gender equality and empowerment of women, will be hosting its sixty-fifth session to discuss the theme of how women can actively participate in decision-making and work toward eliminating violence against women and girls.\nHow can women secure meaningful representation, participation and leadership across multiple challenging sectors in this increasingly uncertain world? How can we as stakeholders change the narrative and advocate for a more equitable future and inclusive world?\nCountries need to make room for women to take up more leadership roles by introducing quotas for more female representation. Getting more women involved will make a huge difference. Having a more gender-balanced government will promote inclusive growth.\nGovernments need to criminalise violence against women and impose sanctions against perpetrators of such crimes. According to a 2016 study, four in five women parliamentarians have experienced psychological violence linked to their job; one in four physical violence; and one in five sexual violence.\nRecently, Aargauer Zeitung suffered an intense backlash when it published a derogatory article about Dr. Ngozi Okonjo-Iweala in its newspaper. The newspaper was forced to retract its statement when the UN Women Leaders and 124 Ambassadors in Geneva signed a petition on calling out the racist and sexist remarks made by the newspaper. We need to hold people accountable for their actions, and the media, especially, has a duty of care to project the right information to the world.\nRoundtable discussions for women leaders to share their experiences, perspectives and expertise can help in building more inclusive post-COVID-19 economies. Finally, it is vital for us to show support, collaborate and celebrate the tremendous efforts and accomplishments by other women across the globe. Only then can we see the progress we need. A challenged world is an alert world. Collectively we can achieve more.\n>>>\nRoberta Annan is the Founder & Managing Partner of Annan Capital Partners, a sector agnostic specialized boutique investment and advisory firm in sub-Saharan Africa. She is also The United Nation Environment Program (UNEP) Supporter for the Creative Economy, and the recipient of several leadership awards. Roberta has spoken on major international platforms such as Concordia Summit, Private Equity Africa Summit, The Global African Investment Summit and others. She has also been featured in The Huffington Post, Forbes, Financial Times, WWD, Vogue and many major publications. She is the Co-founder and Managing Partner of Impact Fund for African Creatives (IFFAC) – a €100 million impact investment fund which will be based in Luxemburg aimed at supporting the creative and lifestyle industries across Africa. An avid philanthropist and impact investor, Roberta is passionate about creating women’s development opportunities across Africa. She is also the Founder of the African Fashion Foundation. Connect with Roberta Annan via Instagram:  @roberta.annan Twitter: @robertaannan LinkedIn: Roberta Annan, Email: \n[email protected]",
            "social_links": {
                "facebook": "https://www.facebook.com/sharer.php?u=https%3A%2F%2Fthebftonline.com%2F2021%2F03%2F11%2Froberta-annan-writes-women-in-leadership-achieving-an-equitable-future-in-a-covid-19-world%2F",
                "twitter": "https://twitter.com/intent/tweet?text=Roberta+Annan+writes%E2%80%A6%E2%80%A6+Women+in+Leadership%3A+Achieving+an+equitable+future+in+a+COVID-19+world&url=https%3A%2F%2Fthebftonline.com%2F2021%2F03%2F11%2Froberta-annan-writes-women-in-leadership-achieving-an-equitable-future-in-a-covid-19-world%2F&via=bftghana",
                "whatsapp": "https://api.whatsapp.com/send?text=Roberta+Annan+writes%E2%80%A6%E2%80%A6+Women+in+Leadership%3A+Achieving+an+equitable+future+in+a+COVID-19+world %0A%0A https://thebftonline.com/2021/03/11/roberta-annan-writes-women-in-leadership-achieving-an-equitable-future-in-a-covid-19-world/"
            },
            "images": [
                "https://i0.wp.com/thebftonline.com/wp-content/uploads/2021/03/roberta.jpg?fit=643%2C909&ssl=1"
            ],
            "tags": "#IWD2021, Roberta Annan, Women in Leadership",
            "source": "Roberta Annan"
        },
        {
            "title": "Shipping line giants face probe into new fees in USA",
            "url": "https://thebftonline.com/2021/08/23/shipping-line-giants-face-probe-into-new-fees-in-usa/",
            "article_posted": "August 23, 2021",
            "categories": "Headlines, Business, Maritime",
            "content": "– is it time for Ghana to consider?\nReports from the USA state that, shipping lines Hapag-Lloyd and CMA CGM are set to face the findings of a US Federal Maritime Commission (the “Commission”) probe into congestion fees that liner operators have begun charging shippers.\nThe Commission announced in a post on 4\nth\n August 2021 (\nwww.fmc.gov\n), that it was requesting documentation from eight companies to see if new fees charged ostensibly due to congestion were implemented properly. They stated that “\nThe Federal Maritime Commission has launched an expedited inquiry into the timing and legal sufficiency of ocean carrier practices with respect to certain surcharges\n”.\nThe report in TradeWinds (an international maritime publication) stated that the some of the other liners targeted are HMM, Matson, Mediterranean Shipping Co, Orient Overseas Container Line, SM Line and Zim. The liners were given until 13\nth\n August 2021 to submit documentation to the Commission.\nThe Commission chairman Daniel Maffei said the agency had been hearing about new, unexpected fees being charged by liners.\n“\nIt seems to me that these factors would already have been included into the record-high rates charged by the carriers\n,” he said in a statement.\nThe Commission is responsible with regulating shipping in accordance with the US Shipping Act and has launched several initiatives following the 9\nth\n July 2021 executive order from President Joe Biden on competitiveness in the US economy.\nThe eight companies called upon to answer to the Commission differ from the nine the watchdog announced in July 2021 that it would be auditing for detention and demurrage practices.\nThe above process is something that may have to be considered by the Ghanaian authorities. There have been consistent complaints from Ghanaian shippers, freight forwarder and agents over cost and surcharges at the Ghanaian ports.\nMSC, CMA CGM, Hapag-Lloyd and HMM are involved in both probes in the USA, with AP Moller-Maersk, Cosco, Ocean Network Express, Evergreen and Yang Ming also included in the probe by the Commission.\nIn a statement to TradeWinds, Hapag-Lloyd said the current sky-high freight rates were the result of “\nexceptionally strong demand\n” from the US, plus from infrastructure bottlenecks across the supply chain.\n“\nWe are doing everything in our power to cope with this strong demand, to provide additional transport capacity and to meet the needs of our customers\n,” the company said.\n“\nAt the same time, these inefficiencies cause additional costs and remain a burden for all market participants, including the carriers\n.”\nThe German company said it always complies “\nwith filing requirements as defined by relevant authorities\n”.\nThe French shipping giant CMA CGM said it is fully complying with the Commission and would “\nprovide them with all relevant information\n”.\nIn addition to the probe and the congestion fee investigation, the Commission has asked for more powers and changes to laws to make it easier for shippers to bring complaints against liners, and it has executed a memorandum of understanding with the Department of Justice’s antitrust division.\nGhanaian industry players have long since challenged the legitimacy of these “arbitrary” surcharges. Clients have cited ongoing service delays, container shortages and punitive surcharges as having emerged in the current market.\nIt may be time for the shipping authorities and regulators in Ghana to also consider such measures as been investigated by the Commission in the USA. It is evident that efforts should be made to assist shippers in Ghana to better understand and challenge any fees that are imposed by shipping lines locally.\nThe writer is the Managing Partner Asare Barimah & Associates ,Maritime and Oil & Gas Specialist\n[email protected]\n ",
            "social_links": {
                "facebook": "https://www.facebook.com/sharer.php?u=https%3A%2F%2Fthebftonline.com%2F2021%2F08%2F23%2Fshipping-line-giants-face-probe-into-new-fees-in-usa%2F",
                "twitter": "https://twitter.com/intent/tweet?text=Shipping+line+giants+face+probe+into+new+fees+in+USA&url=https%3A%2F%2Fthebftonline.com%2F2021%2F08%2F23%2Fshipping-line-giants-face-probe-into-new-fees-in-usa%2F&via=bftghana",
                "whatsapp": "https://api.whatsapp.com/send?text=Shipping+line+giants+face+probe+into+new+fees+in+USA %0A%0A https://thebftonline.com/2021/08/23/shipping-line-giants-face-probe-into-new-fees-in-usa/"
            },
            "images": [
                "https://i0.wp.com/thebftonline.com/wp-content/uploads/2021/08/maersk-port-oakland-2018-fit.jpg?fit=705%2C477&ssl=1"
            ],
            "tags": "Hapag-Lloyd and CMA CGM, Shipping line, Shipping line giants face probe into new fees in USA, US Federal Maritime Commission",
            "source": "thebftonline.com"
        },
        {
            "title": "Data Link Institute to deepen partnerships to deliver quality education",
            "url": "https://thebftonline.com/2021/03/31/data-link-institute-to-deepen-partnerships-to-deliver-quality-education/",
            "article_posted": "March 31, 2021",
            "categories": "Business, Companies, Education, Headlines, Top Headlines",
            "content": "To enhance the delivery of quality and innovative tertiary education, Data Link Institute of Business and Technology is set to deepen its partnerships and collaborations with institutions, both local and international.\nThis, according to the President of the institute, Professor Smile Gavua Dzisi is to enhance academic and research cooperation, capacity building and exchange of experiences, information and best practices.\nThe institute, which is currently is in collaboration with four international universities and affiliated to two major universities locally, including Kwame Nkrumah University of Science and Technology (KNUST) and University of Development Studies, Tamale, is also set to be affiliated to the University of Education, Winneba.\nProf Dzisi, speaking at the latest matriculation ceremony of the institute on Friday in Tema revealed that these partnerships and collaborations are yielding fruitful results and providing opportunities to both lecturers and students to enhance their teaching and learning in the institute and increase their employability as well.\n“In our quest to become of one of the best private academic institutions in the world, the institute continues to collaborate with highly rated universities and other institutions of higher learning across the globe and these efforts are beginning to yield very promising results.\nThese international partnerships and the exchanges are excellent opportunities for students to enrich their educational path and increase their employability. Staff also stand the chance to facilitate the learning and further development of innovative pedagogy which would ultimately serve to improve teaching at the institute. Expert contacts in both academia and industry are being established as well as the identification of common research areas,” she disclosed.\nProf. Dzisi noted that the fresh students which have been enrolled into BSc Business Administration, BSc Computer Science, BSc Information Communication Technology (ICT), and masters programmes in MPhil Strategic Management and MSc strategic management in the COVID-19 pandemic era demonstrated their strive to fulfill their core mandate and vision to teach and to mentor the next generation of future leaders charged with innovation and equipped with technology.\nAs a result, the institute invested in robust infrastructure which enabled them to adopt a blended approach to teaching and learning. She therefore appealed to the corporate body, alumni, and the general public to support the institute. She described the journey of the new students to the school as holistic and entreat them to be modest, hardworking and discipline in their conducts.\nRegistrar of the institute, Kerry Ansah, administered the matriculation oath, whilst students pledged to obey all rules and regulations as well as signed the matriculation cards.",
            "social_links": {
                "facebook": "https://www.facebook.com/sharer.php?u=https%3A%2F%2Fthebftonline.com%2F2021%2F03%2F31%2Fdata-link-institute-to-deepen-partnerships-to-deliver-quality-education%2F",
                "twitter": "https://twitter.com/intent/tweet?text=Data+Link+Institute+to+deepen+partnerships+to+deliver+quality+education&url=https%3A%2F%2Fthebftonline.com%2F2021%2F03%2F31%2Fdata-link-institute-to-deepen-partnerships-to-deliver-quality-education%2F&via=bftghana",
                "whatsapp": "https://api.whatsapp.com/send?text=Data+Link+Institute+to+deepen+partnerships+to+deliver+quality+education %0A%0A https://thebftonline.com/2021/03/31/data-link-institute-to-deepen-partnerships-to-deliver-quality-education/"
            },
            "images": [
                "https://i0.wp.com/thebftonline.com/wp-content/uploads/2021/03/Prof.jpg?fit=600%2C337&ssl=1"
            ],
            "tags": "Data Link Institute",
            "source": "By Evelyn Arthur, Tema"
        },
        {
            "title": "Elevating leadership in telecom sector – Angela Mensah-Poku’s legacy of digital transformation",
            "url": "https://thebftonline.com/2023/11/18/elevating-leadership-in-telecom-sector-angela-mensah-pokus-legacy-of-digital-transformation/",
            "article_posted": "November 18, 2023",
            "categories": "Features",
            "content": "After a decade and half, Angela Mensah-Poku, the Director for Digital Transformation and Commercial, bid farewell to Vodafone Ghana last week, marking an end to an impressive 15-year journey.\nHer contributions drove commercial and operational excellence beyond borders, leaving an indelible mark on the telecom industry in Ghana. Angela’s journey with Vodafone Ghana began in 2009 when she joined as Chief of Staff, becoming one of the first diaspora talents to return to her homeland following Vodafone’s acquisition of Ghana Telecom.\nOver the years, she held various pivotal roles within the organization, including Head of Fixed Services, Head of Corporate Sales, Director for Vodafone Business Solutions and Managing Director Vodafone Wholesale, and, most recently, the Director for Digital and Commercial Operations. Before joining Vodafone, Angela garnered valuable experience at British telecom in the UK.\nAngela’s vision and leadership were instrumental in transforming Fixed Services to deliver exceptional experience to customers, across various segments. As the Director of Digital and Commercial Operations at Vodafone Ghana, she championed the company-wide digital transformation agenda & the introduction of ToBi, AI Chatbot and My Vodafone App. Her initiatives resulted in accelerated commercial growth, digital efficiency, and showcased Angela’s commitment to embracing cutting-edge technologies, including Artificial Intelligence (AI).\nAngela’s leadership shone even brighter during the pandemic, where she prioritized the safety of frontline employees while ensuring the continuity of critical customer operations. Her hands-on approach, which included accompanying engineers on their visits and providing support to retail stores, exemplified her commitment to leading from the front, especially during times of adversity.\nBeyond her corporate endeavours, Angela is a key contributor in driving Women in STEM through her own personal mentorship and as an early supporter of the WiSTEM Programme at KNUST.\nAngela’s exceptional contributions have earned her numerous accolades and recognitions, including the special recognition for her outstanding contribution to the Enterprise and Small Business sector at the ninth edition of the Ghana Information Technology and Telecoms Awards (GITTA) in July 2019, as well as the Best Digital Enabler in 2020, at the 10\nth\n GITTA awards.\nAngela Mensah-Poku holds an MSc in Information Systems and a BSc in Politics. Her continuous pursuit of knowledge and expertise includes completion of the Executive Leadership Programme at the London Business School and Executive Programme in Service Automation: Technologies and Implementation\nShe is a member of the British Chartered Institute of IT, and the Ghana Institute of ICT Professionals, with a focus on Artificial Intelligence (AI), Data Science, and Internet of Things (IoT).\nAs Angela Mensah-Poku embarks on her next chapter, her legacy of leadership and innovation in Ghana’s telecom industry will continue to inspire and shape the future of the sector.",
            "social_links": {
                "facebook": "https://www.facebook.com/sharer.php?u=https%3A%2F%2Fthebftonline.com%2F2023%2F11%2F18%2Felevating-leadership-in-telecom-sector-angela-mensah-pokus-legacy-of-digital-transformation%2F",
                "twitter": "https://twitter.com/intent/tweet?text=Elevating+leadership+in+telecom+sector+%E2%80%93+Angela+Mensah-Poku%E2%80%99s+legacy+of+digital+transformation&url=https%3A%2F%2Fthebftonline.com%2F2023%2F11%2F18%2Felevating-leadership-in-telecom-sector-angela-mensah-pokus-legacy-of-digital-transformation%2F&via=bftghana",
                "whatsapp": "https://api.whatsapp.com/send?text=Elevating+leadership+in+telecom+sector+%E2%80%93+Angela+Mensah-Poku%E2%80%99s+legacy+of+digital+transformation %0A%0A https://thebftonline.com/2023/11/18/elevating-leadership-in-telecom-sector-angela-mensah-pokus-legacy-of-digital-transformation/"
            },
            "images": [
                "https://i0.wp.com/thebftonline.com/wp-content/uploads/2023/11/Angela-Mensah-Poku-Front-Cover-scaled.jpg?fit=2524%2C2560&ssl=1",
                "https://i0.wp.com/thebftonline.com/wp-content/uploads/2023/11/Angela-Mensah-Poku-Inside.jpeg?fit=300%2C447&ssl=1"
            ],
            "tags": "",
            "source": "thebftonline.com"
        },
        {
            "title": "Hannah Affel receives award from Institute of Chartered Shipbrokers-UK",
            "url": "https://thebftonline.com/2022/11/14/hannah-affel-receives-award-from-institute-of-chartered-shipbrokers-uk/",
            "article_posted": "November 14, 2022",
            "categories": "Editors' picks, Lifestyle/Sports, News",
            "content": "Ms. Hannah Affel (MICS) has been awarded the Mediterranean Shipping Company (MSC), UK Award at the Institute of Chartered Shipbrokers’ 2022 International Annual Prize Giving Ceremony at London, United Kingdom.\nThe prestigious award, is in recognition for obtaining the highest mark worldwide in Logistics and Multi-modal Transport in the professional qualification examination as part of the requirements for certification as a Chartered Shipbroker from the Institute of Chartered Shipbrokers (ICS).\nThe Institute of Chartered Shipbrokers is the only internationally recognized professional body in the commercial maritime domain representing shipbrokers, ship managers, and agents in the shipping industry worldwide.\nThe 2022 edition of the Prize Giving Ceremony, recognized candidates across the world who excelled in various Institute subjects during the 2021–2022 academic year.\nHannah, emerged as one of 14 candidates recognized for excellence in various subjects. The 2021/2022 academic year saw 911 students sit 1,560 papers in November 2021 and 1,094 sit 2,164 papers in May 2022 in 85 examination centers across the globe.\nMs. Affel, currently works with the Ghana Shippers’ Authority, holds a Bachelor of Arts degree in Social Work from University of Ghana and is currently pursuing a postgraduate degree in Logistics and Supply Chain Management at Kwame Nkrumah University of Science and Technology. She is a Chartered Shipbroker, a member of the Institute of Chartered Shipbrokers and an expert in the maritime and shipping industry.\nShe sees her accomplishments as an inspiration to others, particularly young women who want to pursue a career in the shipping industry, which is male dominated.\nShe expressed gratitude to Mediterranean Shipping Company (UK), Institute of Chartered Shipbrokers (UK), Institute of Chartered Shipbrokers (West Africa Branch) and her family for their diverse support.",
            "social_links": {
                "facebook": "https://www.facebook.com/sharer.php?u=https%3A%2F%2Fthebftonline.com%2F2022%2F11%2F14%2Fhannah-affel-receives-award-from-institute-of-chartered-shipbrokers-uk%2F",
                "twitter": "https://twitter.com/intent/tweet?text=Hannah+Affel+receives+award+from+Institute+of+Chartered+Shipbrokers-UK&url=https%3A%2F%2Fthebftonline.com%2F2022%2F11%2F14%2Fhannah-affel-receives-award-from-institute-of-chartered-shipbrokers-uk%2F&via=bftghana",
                "whatsapp": "https://api.whatsapp.com/send?text=Hannah+Affel+receives+award+from+Institute+of+Chartered+Shipbrokers-UK %0A%0A https://thebftonline.com/2022/11/14/hannah-affel-receives-award-from-institute-of-chartered-shipbrokers-uk/"
            },
            "images": [
                "https://i0.wp.com/thebftonline.com/wp-content/uploads/2022/11/Hannah-Affel.jpg?fit=1024%2C681&ssl=1"
            ],
            "tags": "Hannah Affel, Institute of Chartered Shipbrokers-UK",
            "source": "thebftonline.com"
        }
    ]
}