{
    "keyword": "Ghana",
    "articles": [
        {
            "title": "African Games 2023: ‘Everybody is applauding Ghana for organizing spectacular games’ – Sports Minister",
            "url": "https://www.myjoyonline.com/african-games-2023-everybody-is-applauding-ghana-for-organizing-spectacular-games-sports-minister/",
            "audio_url": "https://pubcast-files.remixd.com/audios/https___www.myjoyonline.com_african-games-2023-everybody-is-applauding-ghana-for-organizing-spectacular-games-sports-minister?Expires=1710329555&KeyName=pubcast-files-cdn&Signature=2Zmv1lDSEW6l5c4ttjGE8F5XXVY=",
            "artical_posted": "12 March 2024 12:12am",
            "categories": "Athletics | Boxing | Football",
            "content": "Sports Minister, Mustapha Ussif, has claimed that Ghana is receiving great plaudits for their organisation of the ongoing African Games. \nHe made the revelation at a press briefing on Monday evening where he addressed issues emanating from the games. \n“Every international official that we have engaged is applauding us for hosting spectacular games so far. So let’s all embrace and position Ghana as a sports destination,\" he said.\n\"There are a lot of positives that we can talk about. Let’s focus on them,\" he concluded by urging the media to focus on the positives. \nGhana has claimed four medals in the games so far, both coming on Sunday, when Winnifred Ntumi won a gold and two silver medals in the weightlifting, while Abeku Jackson added a silver in the swimming.\nIt moved the country into the top 10 in the medal table after seven days of competition. \nBut despite the minimal success in competition, the games have markedly been fraught with many problems.\nBadminton player, Leslie Addo, revealed he and his teammates were transported to the competition on \nthe bucket of a pick up truck\n, while another cyclist revealed he did not receive new equipment for competition, after his old bicycle broke down only a few minutes after the race start. \nGhana has invested $195 million on infrastructure to host the games, with another $47 million earmarked for operations during the competition which will run from March 8-23, 2024. ",
            "images": [
                "https://www.myjoyonline.com/wp-content/uploads/2024/03/Screenshot-2024-03-08-194533-725x424.png"
            ],
            "tags": "African Games 2023, Mustapha Ussif",
            "source": "Joy Sports"
        },
        {
            "title": "African Games 2023: Ghana’s Beach volleyball sets medal targets after group stage progress",
            "url": "https://www.myjoyonline.com/african-games-2023-ghanas-beach-volleyball-sets-medal-targets-after-group-stage-progress/",
            "audio_url": "https://pubcast-files.remixd.com/audios/https___www.myjoyonline.com_african-games-2023-ghanas-beach-volleyball-sets-medal-targets-after-group-stage-progress?Expires=1710329555&KeyName=pubcast-files-cdn&Signature=aNWQg5nCXNlU3u8CnC6I-ICdTsc=",
            "artical_posted": "12 March 2024 11:48am",
            "categories": "Other Sports",
            "content": "After securing qualification to the second round of the men's beach volleyball competition, Ghana's coach Chapnuor Eden has tasked the team to win the gold medal.\nGhana progressed from the Men's Pool F after Tuesday's 2-0 win over Benin in the men's Pool F.\nOn Monday, Ghana secured a 2-1 win over Togo and a more straightforward 2-0 win over Senegal.\nSpeaking to JoySports, Chapnuor Eden said he had high hopes of Ghana's team.\n\"We couldn't win gold at the last tournament we hosted here; the Commonwealth Qualifiers.\nFor the men's side we couldn't but I'm confident we can get a gold medal in this African Games.\"\nThe women's team has also progressed from the Women's Pool Aafter successive wins over The Gambia (2-1) and Burkina Faso (2-0).\n\"We have an experienced team that keeps improving.\nWe conquered the whole of Africa here for the Commonwealth Games in Birmingham in the women's category,\"\n\"I know we can get a silver medal and that's what we're working towards.\" he told JoySports.\nGhana has won its first two matches without number one ranked player, Rashaka Katadat.\nKatadat's partner at the 2022 Commonwealth Games, Corporal Juliana Otcherewaa Aryee has been teamed up with Lance Corporal Charity Torku.\nExpectations are high after a number impressive performances at major tournaments.\nAt the West Africa Zone II Olympic Qualifier, the men's team won gold while the ladies took silver.",
            "images": [
                "https://www.myjoyonline.com/wp-content/uploads/2024/03/1000002441-565x424.jpg"
            ],
            "tags": "African Games 2023, Beach Volleyball",
            "source": "Victor Atsu Tamakloe"
        },
        {
            "title": "Energy sector debt poses greatest risk to Ghana’s economy – Minority warns",
            "url": "https://www.myjoyonline.com/energy-sector-debt-poses-greatest-risk-to-ghanas-economy-minority-warns/",
            "audio_url": "https://pubcast-files.remixd.com/audios/https___www.myjoyonline.com_energy-sector-debt-poses-greatest-risk-to-ghanas-economy-minority-warns?Expires=1710329556&KeyName=pubcast-files-cdn&Signature=t-hrPCAbvAy8uoeo1y2G8ncN6IU=",
            "artical_posted": "12 March 2024 9:41am",
            "categories": "National",
            "content": "The Minority Leader in Parliament, Dr. Cassiel Ato Forson, has emphasised that the debt plaguing the energy sector poses an immense threat to Ghana's economy.\nDr. Ato Forson warned that if not addressed promptly, this debt could potentially lead to a complete collapse of the nation's economy.\nAddressing President Akufo-Addo's 2024 State of the Nation Address on Monday, March 11, the leader of the NDC Caucus in Parliament stressed the urgent need for action to prevent any further deterioration in the situation.\nHe expressed concern that the Ghanaian population is already bearing the brunt of the current economic crisis and cannot afford to endure additional disruptions in the energy sector.\nDr. Ato Forson criticised the Akufo-Addo government for its mismanagement of the energy sector since assuming office in 2017.\nHe asserted that the upcoming 2024 general elections provide an opportunity for the National Democratic Congress (NDC) to rectify these issues and restore stability to the sector.\n“The reality, Mr Speaker, is that this crippling indebtedness and the mess in the power sector, created by the Akufo Addo/Bawumia government, remains the biggest threat to the Ghanaian economy,” he said.\n“This Akufo-Addo/Bawumia NPP government owes in excess of $1.5 billion to Independent Power Producers (IPPs),” he added.",
            "images": [
                "https://www.myjoyonline.com/wp-content/uploads/2023/03/image-94-800x424.png"
            ],
            "tags": "Ato Forson, Energy Sector, Minority, SONA",
            "source": "Ernest K. Arhinful"
        },
        {
            "title": "Ghana in talks with Benin and Gambia for free mobile roaming services – Bawumia",
            "url": "https://www.myjoyonline.com/ghana-in-talks-with-benin-and-gambia-for-free-mobile-roaming-services-bawumia/",
            "audio_url": "https://pubcast-files.remixd.com/audios/https___www.myjoyonline.com_ghana-in-talks-with-benin-and-gambia-for-free-mobile-roaming-services-bawumia?Expires=1710329556&KeyName=pubcast-files-cdn&Signature=KBAhvJH7YvecgN15ldTXPdRyZXE=",
            "artical_posted": "12 March 2024 7:30am",
            "categories": "Telecom",
            "content": "The Ghana government through the National Communications Authority is in talks with The Gambia and Benin to roll out free mobile roaming services for their citizens.  \nThis will mean that Ghanaian businessmen and women, tourists, or traders traveling to these countries won't be required to pay additional services for data or any other mobile services.\nSpeaking at a platinum night event to welcome telecommunication service provider, Telecel, into Ghana, Vice President Dr. Mahmud Bawumia said this move will enhance businesses among these countries when it becomes successful.\nThe move is also part of a broad ECOWAS initiative aimed at connecting member countries digitally with ease.\n“Government has been able to reach an agreement with neighboring Togo to roll out free roaming services on all networks in both countries. And at the moment, the National Communications Authority is in the process of signing a similar agreement with Benin and The Gambia so citizens can connect easily when they are in each other’s territory”, he stated.\nThe Vice President therefore urged the company to ensure affordable and quality services to customers as many still have challenges with voice quality.\nThe Chief Executive Officer of Telecel Ghana, Patricia Obo-Nai, told Joy Business that the takeover of Vodafone has been strategic to ensure a competitive market for the Ghanaian consumer.\nShe assured that there will be a massive investment in digital services including its financial technology and data services.\nThe platinum night event was a platform for the new company to engage stakeholders in the industry and policymakers on the planned roll-out of the Telecel service.\nMeanwhile, the Government of Ghana still maintains its 30% stake in the company despite the exit of Vodafone from the Ghanaian market.",
            "images": [
                "https://www.myjoyonline.com/wp-content/uploads/2024/03/Bawumia_Africa--499x424.jpg",
                "https://www.myjoyonline.com/wp-content/uploads/2024/03/WhatsApp-Image-2024-03-12-at-07.46.48-1024x576.jpeg"
            ],
            "tags": "Dr. Bawumia, Patricia Obo-Nai, roaming services, Telecel",
            "source": "Ebenezer Sabutey"
        },
        {
            "title": "ADC President and Agatex Paint CEO call for industrial revolution policies in Ghana’s 2024 election manifestos",
            "url": "https://www.myjoyonline.com/adc-president-and-agatex-paint-ceo-call-for-industrial-revolution-policies-in-ghanas-2024-election-manifestos/",
            "audio_url": "https://pubcast-files.remixd.com/audios/https___www.myjoyonline.com_adc-president-and-agatex-paint-ceo-call-for-industrial-revolution-policies-in-ghanas-2024-election-manifestos?Expires=1710329557&KeyName=pubcast-files-cdn&Signature=x2uJtHC8s3cZEUmcgDKS5aaLQXk=",
            "artical_posted": "12 March 2024 1:55am",
            "categories": "National",
            "content": "In a joint effort to bolster Ghana's industrial sector, Dr Bright Atsu Sogbey, President of the Africa Development Council (ADC), and Mr Stephen Adom, CEO of AGATEX Paint Limited, have urged the country's two main political parties to prioritise practical, industrial revolutionary policies in their manifestos for the upcoming 2024 general elections.\nThe call for action was made during a courtesy call on the Volta Regional Chairman of the National Democratic Congress (NDC) and some New Patriotic Party (NPP) members in Ho, where both Dr Sogbey and Mr Adom highlighted the critical need for Ghana to embark on a robust industrial revolution to drive economic growth, create jobs, and enhance the nation's global competitiveness.\nDr Sogbey emphasised the importance of Ghana's industrial sector in achieving sustainable development goals, stating, \"Ghana's industrialization is key to unlocking its potential for economic prosperity. Our political leaders must prioritise policies that will transform our industrial landscape, attract investments, and harness the talents and resources of our people.\"\nMr Adom echoed these sentiments, pointing out that the manufacturing sector, in particular, holds immense promise for Ghana's economic advancement.\n\"As a representative of the private sector, I can attest to the untapped potential within our manufacturing industry. We need innovative policies that support local industries, encourage value addition, and promote exports,\" he stated.\nBoth leaders emphasised the need for policies that address challenges such as access to finance for small and medium enterprises (SMEs), reliable energy supply, infrastructure development, and skills training to build a competent workforce.\n\"Political parties must move beyond rhetoric and provide clear, actionable plans for Ghana's industrial revolution,\" Dr Sogbey urged. \"This includes fostering partnerships between the public and private sectors, leveraging technology for efficiency, and creating an enabling environment for businesses to thrive.\"\nMr Adom further highlighted the role of sustainable practices in Ghana's industrial growth, stating, \"We cannot overlook the importance of environmentally friendly practices. Our policies must align with global standards for sustainability, ensuring that our industrialization efforts do not compromise the future of our planet.\"\nThe ADC President and AGATEX Paint CEO expressed readiness to collaborate with political parties, offering expertise and insights to develop policies that will drive Ghana's industrial transformation.\nAs Ghana prepares for the 2024 general elections, Dr Bright Atsu Sogbey and Mr Stephen Adom's call serves as a poignant reminder of the pressing need for visionary, practical-oriented industrial revolutionary policies to propel the nation towards a brighter and more prosperous future.\nThe eyes of the nation now turn to the political parties, awaiting their response and commitment to this crucial cause.\nIn response, the Volta Regional Chairman of the NDC, Mawutor Agbavitor noted that the NDC as a party has industrialization as one of their priority areas and plans to make it work to create more jobs.\nMr Mawutor Agbavitor commended the team for their efforts in helping with Ghana's industrialization and also urged them to do their best at making their votes count in the upcoming elections.",
            "images": [
                "https://www.myjoyonline.com/wp-content/uploads/2024/03/1-34-424x424.jpg",
                "http://www.myjoyonline.com/wp-content/uploads/2024/03/2-20-1024x1024.jpg",
                "https://www.myjoyonline.com/wp-content/uploads/2024/03/4-10-1024x1024.jpg",
                "http://www.myjoyonline.com/wp-content/uploads/2024/03/3-15-1024x1024.jpg"
            ],
            "tags": "ADC President, Agatex Paint CEO, industrial revolution",
            "source": "Ivy Setordjie "
        },
        {
            "title": "African Games 2023: Ghana ends men’s beach volleyball group stage with perfect record",
            "url": "https://www.myjoyonline.com/african-games-2023-ghana-ends-mens-beach-volleyball-group-stage-with-perfect-record/",
            "audio_url": "https://pubcast-files.remixd.com/audios/https___www.myjoyonline.com_african-games-2023-ghana-ends-mens-beach-volleyball-group-stage-with-perfect-record?Expires=1710329557&KeyName=pubcast-files-cdn&Signature=Vf8z_YYmBT5ZZTNSh1eIcrzr0n4=",
            "artical_posted": "12 March 2024 11:47am",
            "categories": "Other Sports",
            "content": "Ghana has progressed from the Men's Pool F of the beach volleyball competition after a 2-0 win over Benin.\nGhana, who had already qualified before Tuesday's match, dispatched their opponents in two straight sets in the days second contest.\nOn Monday, Ghana secured a 2-1 win over Togo and a more straightforward 2-0 win over Senegal.\nHowever, the third Pool match had to be rescheduled to Tuesday due to poor visibility.\nMonday's pair of Paul Akan and Seidu Agyinaku were retained for today's match and are likely to play in the first knockout stage match later today.\nGhana will learn of their next opponent's after the draw at midday.\nMeanwhile, the women's team has also progressed from the Women's Pool A after successive wins over The Gambia (2-1) and Burkina Faso (2-0).\nGhana won its first two matches without number one ranked player, Rashaka Katadat.\nKatadat's partner at the 2022 Commonwealth Games, Corporal Juliana Otcherewaa Aryee has been teamed up with Lance Corporal Charity Torku.",
            "images": [
                "https://www.myjoyonline.com/wp-content/uploads/2024/03/1000002346-565x424.jpg"
            ],
            "tags": "African Games 2023, Beach Volleyball",
            "source": "Victor Atsu Tamakloe"
        },
        {
            "title": "African Games: Ghana’s Joselle Mensah qualifies for Women’s 50m backstroke final",
            "url": "https://www.myjoyonline.com/african-games-ghanas-joselle-mensah-qualifies-for-womens-50m-backstroke-final/",
            "audio_url": "https://pubcast-files.remixd.com/audios/https___www.myjoyonline.com_african-games-ghanas-joselle-mensah-qualifies-for-womens-50m-backstroke-final?Expires=1710329558&KeyName=pubcast-files-cdn&Signature=2igfc-vkGd06r3NdmXSTMENBRkQ=",
            "artical_posted": "12 March 2024 11:39am",
            "categories": "Other Sports",
            "content": "Ghana’s Joselle Mensah is through to the women’s 50m backstroke final  after finishing third in her heat. \nMensah finished with a time of 33.73 seconds, behind South Africa’s Jill Meyer and Algeria’s Raina Nefsi. \nMensah’s time was the sixth fastest overall in the heats. \nHer teammate, Unilez Takyi, also qualified for the final, finishing third with a time of 35.22 seconds. \nThe women’s 50m backstroke final will take place later on Tuesday, during the evening session. ",
            "images": [
                "https://www.myjoyonline.com/wp-content/uploads/2024/03/IMG_9094-1-635x424.jpeg"
            ],
            "tags": "African Games, Joselle Mensah",
            "source": "Daniel Koranteng"
        },
        {
            "title": "Kweku Aggrey-Orleans: Ghana must prove its Independence",
            "url": "https://www.myjoyonline.com/kweku-aggrey-orleans-ghana-must-prove-its-independence/",
            "audio_url": "https://pubcast-files.remixd.com/audios/https___www.myjoyonline.com_kweku-aggrey-orleans-ghana-must-prove-its-independence?Expires=1710329558&KeyName=pubcast-files-cdn&Signature=GsRHyygijH-1iVBmzhxBLguCHPc=",
            "artical_posted": "12 March 2024 9:17am",
            "categories": "National | Opinion",
            "content": "Today many of us woke up to celebrate Ghana’s Independence Day: 06.03.57. \n“God bless our homeland Ghana and make \nour nation great and strong, Bold to defend forever the cause of Freedom and of Right”\n. However this year, so close to the next set of elections, which are bound to change the “\nmandems\n”, there was a distinct sense of a need to identify why Ghana’s independence feels so different on its 67\nth\n birthday. A day of just celebration without reflection appeared awkward and unnatural this year.  Social media today certainly appears to support a deeper inflection.\nIndependence was hard fought in treachery, in prison cells, in blood and politically with Kwame Nkrumah emerging as the new Prime Minister of Ghana or as reported in the press of the time, the first “\nAfrican Prime Minister of an African Colony\n”, after the success of his CPP at the polls. The bloodshed of 1948, when Ghanaian World War II veterans seeking compensation for their war service were gunned down by the Colonial Police force in Accra, certainly galvanized the desire to be rid of an oppressor. So too the apartheid-style policies pursued by the British in restricting the access of Africans to certain neighborhoods. Gradual “\nconcessions\n” in respect of local governance (local and district councils) by the oppressor from 1951, when Kwame Nkrumah marched out of Jamestown Fort, started this “\njourney\n” towards independence.\nAfter centuries of wrangling with disingenuous foreign parties from the Portuguese in 1482, through the Dutch, Swedes, Danes to the British - who in 1821 “\nestablished\n” the Gold Coast colony, before going on to conquer other groups and “\npurchase\n” lands, not from Africans, but from the Dutch and Danes - the Ghanaian African finally had a “\ngeographical space” \nfrom which to operate, free in theory from the parliamentary reach of the UK\n.\nThe independence day that we celebrate as Ghanaians is the day that the Ghana Independence Act 1957 came into effect “\nto make provision for…..the attainment by Gold Coast of fully responsible status within the British Commonwealth of Nations.”\n This was a 5-section, 2 schedule, and 8-page Act of the British Parliament, which Act had received Queen Elizabeth II assent on 07.02.57, and sought to cobble together the formerly exploited territories of Gold Coast, Ashanti, the northern territories and British Togoland – the latter taken from the Germans after WW1 in 1918 – under the name Ghana.\nIn many respects, the 6\nth\n March 1957 was not independence day, but an “\nonboarding day towards potential full nationhood\n” to the extent that a significant minority of the inhabitants of British Togoland did not want to become nationals of Ghana, and to the extent that it was possible to thrive as the only African country within the \n“British Commonwealth of Nations”\n under the British Monarch. The Notting Hill riots of 29\nth\n August through to 5\nth\n September 1958 were demonstrative of the prevailing attitudes of the day towards race.\nIt was Parliament that was to be trusted with Ghana’s development, and it was not until 01.07.60 that Ghana became a Republic – severing links to the UK - with Kwame Nkrumah as President.\nThat is not to say that the Ghana Independence Act 1957 was not significant. It was. Its key obsession was to establish the Ghanaian Parliament as the sole legislative authority of the land: No act of the UK Parliament passed on or after 06.03.57 could extend to Ghana, the UK Government had no responsibility for the government of Ghana, the Ghanaian Parliament had full power to make laws – even laws that were “\nrepugnant to the law of England\n” – previously made unlawful by the Colonial Laws Validity Act 1865. The loss of British nationality and access to “\nbenefits\n” from the “Colonial Development and welfare” fund were byproducts of independence.   \nTo say that Ghanaian independence was seen by many Europeans as an experiment to establish whether Africans could establish stable, democratic and independent states is an understatement. Whilst \n“Salute to a new nation”\n was its headline, the Daily Mirror of Wednesday 06.03.57,on page 7, ran a photograph of dancing ladies under the headline\n “This is how they do the highlife”\n.  \nEven then in 1957 and hidden from view, the waters were not calm, despite the photographs of women in elegant white gloves twisting through the night. How long the dance continued is a matter of some debate. But Ghana’s first - off dance floor - fights were arguably with itself, through its politicians.\nThe promulgation of the Preventive Detention Act 1958, an act which made lawful the detention without trial for five years (later extended to 10 years in 1959 then indefinitely) and without right of appeal for conduct considered by the government to be prejudicial to the defence and security of Ghana, probably best illustrates the tense political atmosphere. The de-stooling of anti-Nkrumah chiefs soon after independence and / or Dr Busia the leader of the opposition’s exile in 1957 cannot have been a great look to any well-wishing observer of the new nation.\nThe lead up to the 6\nth\n March 2024 has not been great either: Ghana’s sense of financial independence has taken a battering, its return to the IMF is yet to yield, especially juxtaposed against Ghana’s strong oratorial performances at podiums, and the “\nissue with the bonds\n” continues as a weeping wound. Further, to some, the notion of Ghana beyond aid is well and truly buried, the stone from Israel will not found a national cathedral designed by Ghana’s own world celebrated architect and economic data points remain contentious in differing from the lived experience.\nIt was therefore of note that it was Ghana’s Parliament, and not its government, that this week drew undoubtedly negative international attention to Ghana and has sought to test the tensile strength of Ghana’s independence. In the week of its independence, Ghana appeared to spin unnecessarily away from reason, when its usually divided Parliament passed a bipartisan bill, unusually named the Proper Human Sexual Rights and Ghanaian Family Values Bill (“PHSRGFVB” to those who take umbrage with the acronym LGBTQIA+), itself the antithesis to the defence of “\nthe cause of freedom and of right\n”.  Views on the Bill amongst Ghanaians differ wildly, but there can be little doubt that \nGhana’s Parliament has placed an independence bomb on the President’s desk, with the Supreme Court being called on to, hopefully, act as the bomb disposal unit\n. There can also be little doubt that Ghana’s independence, in the most obvious and original sense of being empowered to pass its own laws, is under enormous pressure following the strident announcement by valued foreign \n“partners and friends”\n of Ghana of the withdrawal of cold cash / investment, if the President signs the Bill into law.\nEmpowering Ghana’s Parliament, section 2 of the first Schedule of the Ghana Independence Act, 1957 provided, as follows:\n“No law and no provision of any law made on or after the appointed day by the Parliament of Ghana shall be void or inoperative on the ground that it is repugnant to the law of England, or to the provisions of any existing or future Act of the Parliament of the United Kingdom.”\nThe PHSRGFVB is obviously \n“repugnant”\n to the UK’s Equality Act 2010, which enshrines the rights of the LGBTQ community not to suffer discrimination in employment, education, public services etc.  Post 1957 independence, the comparative exercise to the laws of England no longer matters in assessing the legality of Ghana law. This is great. However, it is through the comparative exercise to those rights that Ghana collectively values, as enshrined in the articles of its 1992 Constitution, that Ghana will best be able to demonstrate the strength of her independence in 2024.\nJust as the international community looked on to see if an African Colony would be run by Africans, so Ghanaians and their well-wishers will look on to see how Ghana protects its independence. The 1992 Constitution contains express provisions on the process to be followed once Parliament presents a bill for signature by the President and what occurs if the President refuses to sign the bill (see art 106(7) to (10) of the Constitution). The Constitution also contains fundamental rights and balances between the powers of Parliament, the Executive and the judiciary. All three are scheduled to meet in the Supreme Court and a constitutional resolution will be Ghana’s best 67\nth\n birthday present. A grab for cash dangled by foreign partners will not satisfy those interested in the continued building of the nation!\nKwame Nkrumah inspired Ghana’s / Africa’s independence movement, became a dictator and was then overthrown. Ghana has been building on its independence since and somewhere along its journey, the importance of strong institutions of state has emerged.\n“Fill our hearts with true humility,\nMake us cherish fearless honesty….”\nWe still can.\nKweku Aggrey-Orleans\n06.03.24",
            "images": [
                "https://www.myjoyonline.com/wp-content/uploads/2021/07/GettyImages-1330212249-618x424.jpg"
            ],
            "tags": "Africa, Apartheid, Colonial, freedom, Ghana, Independence",
            "source": "Kweku Aggrey-Orleans"
        },
        {
            "title": "Tony Asankomah explains why there are few Ghanaian movies on Netflix",
            "url": "https://www.myjoyonline.com/tony-asankomah-explains-why-there-are-few-ghanaian-movies-on-netflix/",
            "audio_url": "https://pubcast-files.remixd.com/audios/https___www.myjoyonline.com_tony-asankomah-explains-why-there-are-few-ghanaian-movies-on-netflix?Expires=1710329559&KeyName=pubcast-files-cdn&Signature=LC3LvMJ4vUcKU4HRGFkebwXkuqY=",
            "artical_posted": "12 March 2024 12:28pm",
            "categories": "Movies",
            "content": "Ghanaian film critic, Tony Asankomah, has broached the topic of film distribution in Ghana and its concomitant effects.\nIn a recent interview on \nJoy FM\n’s \nShowbiz A-Z\n he attributed the lower visibility of Ghanaian films on Netflix to distribution gap. \n“A lot goes into it, talking about the quality and the standards, the requirements that they need to enable you get your film onto Netflix. But I have maintained and I am saying this that, our biggest problem as a space is because we do not have Ghanaian distributors who understand the terrain for distribution of films now.\nSo all the Ghanaian films that you see on Netflix, they didn’t get there by chance. They went through a distributor who could be a Nigerian or South African company who understands the model and these distribution companies always have a quota of films they have to submit. So of course, I am from this country, I would prioritize content coming from my country that content coming from Ghana,\" he told the host Kwame Dadzie.\nHe emphasised that he had seen some very good Ghanaian films that could not make it through to Netflix because of the distributor they dealt with, and he was also privy to some very horrible films from different parts of the world ended up on Netflix.\nHe also touched on the business of demand meeting supply, as one of the reasons there are not many Ghanaian movies on Netflix. \n“We have come to understand how Nigerians paying for subscription. So if Netflix is paying for their data they know where the money is coming from. They know those who are paying more for subscription. They will entertain them. They look at the analytics and know the type of films they watch, these are the kind of content they are interested in,\" he said. \nNetflix is an American subscription video on-demand over-the-top streaming service that primarily distributes original and acquired films and television shows from various genres, and it is available internationally in multiple languages.\nSome Ghanaian films on Netflix are 'The Burial of Kojo', 'Keteke', 'Azali', 'Gold Coast Lounge', 'Side Chic Gang', 'Aloe Vera', 'Ties That Bind', among others. ",
            "images": [
                "https://www.myjoyonline.com/wp-content/uploads/2024/03/asankonah-740x424.jpg"
            ],
            "tags": "Netflix, Tony Asankomah",
            "source": "Joy Entertainment "
        },
        {
            "title": "King Ampaw encourages use of local languages in Ghanaian films",
            "url": "https://www.myjoyonline.com/king-ampaw-encourages-use-of-local-languages-in-ghanaian-films/",
            "audio_url": "https://pubcast-files.remixd.com/audios/https___www.myjoyonline.com_king-ampaw-encourages-use-of-local-languages-in-ghanaian-films?Expires=1710329559&KeyName=pubcast-files-cdn&Signature=ua4ekHh2KMcRuDwZt7NsW7HfvAY=",
            "artical_posted": "12 March 2024 12:59pm",
            "categories": "Movies",
            "content": "Veteran movie producer King Ampaw has advised Ghanaian film makers to use Ghanaian languages in their movies.\nKing said on \nJoy FM\n’s Showbiz A-Z that one way of shaping the Ghanaian society with film is being original with content.\nApart from using Ghanaian languages, he also proposed that more local locations should be explored for Ghanaian films. \n“I personally encourage film productions to be done in our local areas in our local languages. These attract a majority of our people in our society and also have more effect on them,\" he the host Kwame Dadzie.\nHe also noted that to be able to market Ghana to the world like Hollywood has done to America, Ghanaian film makers need depict real lifestyle of the people to the world.\nHe said that regardless of the fact that society has become global and there is an inclination towards acculturation, there should be a deliberate attempt to project the Ghanaian culture. \nThe legendary movie producer further stated that regardless of the myriad of problems facing the Ghanaian movie industry, there are prospects. \n\"Although I am not happy about the quality of most of these productions, I know that Rome was not built in a day.  Modern production is now finding its way into the African industry and the industry is now being built. We must work hard towards it,\" he said. \nIn their bid to maximise their potentials in the industry, King Ampaw also advised film makers in Ghana not to bank their hopes on government’s financial aid for their movie productions.\nAccording to King who is popularly known for the 1983 movie ‘Kukurantumi: Road to Accra’, funds provided by governments for film productions usually don’t suffice for the real work.\n\"Actually, to put the facts down, commercial productions have got very little, not much to do with government. It is purely private business because of the money involved,\" he said.\nKing said the government can only give those funds which will cushion film makers but for a full production they need more than the government fund can support.\n\"Unfortunately, the young people here have been emphasising it most times. I think that has made us a little bit lazy.\nAfter all, how much money can the government give to the so many film makers? Now, listen to this, the whole government film fund, I may use it for only one movie production. We might have to change our attitude and minds on that,\" he said.\nKing Ampaw is famed for movies such as \nThey Call it Love, Kukurantumi, Road to Accra, Juju (Nana Akoto), No Time to Die\n, among others. ",
            "images": [
                "https://www.myjoyonline.com/wp-content/uploads/2024/03/KingAmpaw-658x424.png"
            ],
            "tags": "King Ampaw, local languages",
            "source": "Joy Entertainment "
        },
        {
            "title": "Ghana’s energy transition focused on manufacturing of clean energy – Dr Opoku Prempeh",
            "url": "https://www.myjoyonline.com/ghanas-energy-transition-focused-on-manufacturing-of-clean-energy-dr-opoku-prempeh/",
            "audio_url": "https://pubcast-files.remixd.com/audios/https___www.myjoyonline.com_ghanas-energy-transition-focused-on-manufacturing-of-clean-energy-dr-opoku-prempeh?Expires=1710329560&KeyName=pubcast-files-cdn&Signature=QqBHzMMbpo3FdFEFYn1GnllZopY=",
            "artical_posted": "12 March 2024 1:22pm",
            "categories": "National",
            "content": "The Minister for Energy, Dr. Matthew Opoku Prempeh, has reiterated Ghana's commitment to a clean energy-focused transition plan.\nHe emphasised the government's dedication to leaving no stone unturned in ensuring that the transition does not harm the environment.\nDr. Opoku Prempeh underscored the importance of a holistic approach to implementation to guarantee success for the plan.\nAddressing attendees at the Africa Energy Technology Conference held at the Labadi Beach Hotel on Tuesday, March 12, Dr. Opoku Prempeh, also the Member of Parliament for Manyhia South, urged other African nations to adopt similar strategies.\nHe warned that failure to do so could undermine the significant efforts invested in the transition, ultimately leading to counterproductive outcomes.\nDr. Opoku Prempeh's remarks highlight Ghana's proactive stance in addressing both energy needs and environmental concerns. By prioritizing clean energy initiatives, the government aims to achieve sustainable development while minimizing ecological damage.\n“However, the journey towards this future must be inclusive and equitable. We cannot afford to leave anyone behind. As we embrace new technologies and policies, we must ensure that they benefit all segments of society, particularly the most vulnerable.”\n“We mustprioritize access to clean and affordable energy for remote communities, empowering women and youth in the energy sector, and fostering partnerships that promote capacity building and knowledge transfer.”\n \n“A just energy transition demands a holistic approach that integrates energy policy with broader development objectives, including poverty alleviation, job creation, and environmental sustainability. We must break down silos and foster collaboration across sectors and borders to maximize the impact of our efforts.”\nHis call for a holistic approach underscores the interconnected nature of energy and environmental policies.\nThe Minister's advocacy for clean energy aligns with broader global efforts to combat climate change and promote renewable resources.\nGhana's commitment is a beacon for other African countries seeking to balance energy security with environmental stewardship. Dr. Opoku Prempeh's message resonates with the imperative of prioritizing long-term sustainability over short-term gains.\nIn conclusion, Dr. Matthew Opoku Prempeh's statements at the Africa Energy Technology Conference reflect Ghana's determination to lead the way in a clean energy transition. His call for comprehensive strategies and collective action underscores the importance of unity in addressing the dual challenges of energy security and environmental protection across the continent.",
            "images": [
                "https://www.myjoyonline.com/wp-content/uploads/2021/04/Dr-Mathew-Opoku-Prempeh-731x424.jpg"
            ],
            "tags": "Dr Opoku Prempeh, Energy transition, Ghana",
            "source": "MyJoyOnline.com"
        },
        {
            "title": "Ghanaians are economical with the truth – Seidu Alidu",
            "url": "https://www.myjoyonline.com/ghanaians-are-economical-with-the-truth-seidu-alidu/",
            "audio_url": "https://pubcast-files.remixd.com/audios/https___www.myjoyonline.com_ghanaians-are-economical-with-the-truth-seidu-alidu?Expires=1710329561&KeyName=pubcast-files-cdn&Signature=cE0eH1HRzWAR54hNiQZ2hLWSVhY=",
            "artical_posted": "12 March 2024 12:18pm",
            "categories": "National",
            "content": "Head of the Political Science Department at the University of Ghana, Seidu Alidu, says most Ghanaians have a tendency to avoid being truthful, especially when it comes to acknowledging their own shortcomings.\nAccording to Professor Alidu, this reluctance stems from a deep fear of judgment and criticism. He said many individuals worry that admitting the truth may reflect negatively on their image.\nHis remarks follow former President John Mahama's assertion that his commitment to transparency during his tenure in office may have posed some challenges for his government.\nThe 2024 flagbearer of the opposition National Democratic Congress (NDC) expressed concerns over the current government's lack of transparency, particularly regarding recent power issues; hinting that vital information may be withheld from the public.\n Touching on this, Professor Alidu said the demand for honesty from leaders should also extend to the citizens.\n“Because over the years, maybe our leaders realized that this is what they want, so even if you are not doing it, just say you are doing it, then they would believe you because maybe they are also like that, but when we begin to make sure we shine in our little corners that we occupy, whichever way we look at it, there would be consequences, but it is always good to be on the right path,” he added.\nProfessor Alidu urged Ghanaians to recognize their own role when it comes to the dishonest practices at the national political level.\n“Honestly speaking, we all have to examine ourselves, and we have all contributed in some way to this national-level dishonesty in our politics. It has to start with us to be able to set the record straight and do things right.”",
            "images": [
                "https://www.myjoyonline.com/wp-content/uploads/2024/03/Dr.-Alidu-Seidu.jpg"
            ],
            "tags": "Seidu Alidu, University of Ghana",
            "source": "Isaac Kafui Nyanyovor"
        },
        {
            "title": "Standard Bank predicts 3.2% growth rate for Ghana in 2024",
            "url": "https://www.myjoyonline.com/standard-bank-predicts-3-2-growth-rate-for-ghana-in-2024/",
            "audio_url": "https://pubcast-files.remixd.com/audios/https___www.myjoyonline.com_standard-bank-predicts-3-2-growth-rate-for-ghana-in-2024?Expires=1710329561&KeyName=pubcast-files-cdn&Signature=qEXuWC4ZGk4V2aoykJErep5kRcY=",
            "artical_posted": "12 March 2024 1:23pm",
            "categories": "Economy",
            "content": "Africa’s biggest bank, Standard Bank is predicting a stronger growth rate of about 3.2% for Ghana in 2024, higher than that of the International Monetary Fund.\nThe Fund had earlier projected a 2.8% rate for the country.\nThe 3.3% Gross Domestic Product (GDP) growth rate for Ghana in 2024 places it 16th out of 18 countries captured by the Standard Bank.\nAccording to Africa’s biggest bank, the expansion of the economy this year will be driven by the services sector.\nHowever, El Niño weather, debt burdens, and geopolitics would still pose risks to growth.\n“Notably, unfavourable weather concerns, renewed geopolitical risks, and ongoing debt sustainability challenges constraining the fiscal capacity to spur growth, are the primary downside risks for economic growth in SSA [Sub Saharan Africa] for 2024”.\nHistorically, Ghana’s economy has been expanding by 5% year-on-year until Covid-19 emerged in 2019.\nData from the Ghana Statistical Service showed an expansion in the economy by an annual rate of 2.0 percent in the third quarter of 2023, driven by the services and agriculture sectors.\nThis was, however, compared with 2.7% over the same period in 2022. \nMeanwhile, Ethiopia will record the largest growth rate of nearly 10% in Africa in 2024.\nThe IMF expects GDP growth in Sub-Saharan Africa (SSA) to rebound to around 4.0% in 2024, from an expected 3.3% in 2023.",
            "images": [
                "https://www.myjoyonline.com/wp-content/uploads/2021/04/Standard-Bank1-635x424.jpg",
                "https://www.myjoyonline.com/wp-content/uploads/2024/03/Capture.png"
            ],
            "tags": "GDP, IMF, Standard Bank",
            "source": "Joy Business"
        },
        {
            "title": "Agya Koo condemns insults and sex scenes in Ghanaian movies",
            "url": "https://www.myjoyonline.com/agya-koo-condemns-insults-and-sex-scenes-in-ghanaian-movies/",
            "audio_url": "https://pubcast-files.remixd.com/audios/https___www.myjoyonline.com_agya-koo-condemns-insults-and-sex-scenes-in-ghanaian-movies?Expires=1710329562&KeyName=pubcast-files-cdn&Signature=7qvT_LFxot3r2stqberHBGhJsgs=",
            "artical_posted": "12 March 2024 2:56pm",
            "categories": "Movies",
            "content": "Actor Kofi Adu, popularly known as Agya Koo, has urged filmmakers in the country to moderate the use of insults in dialogue and tone down explicit sex scenes in movies.\nExpressing his concerns on Joy FM’s Showbiz A-Z, he criticised the portrayal of graphic sex in films, citing its detrimental impact on societal morals, particularly among young viewers.\nAgya Koo emphasised that children often watch these movies and could easily adopt negative behaviours such as the use of insults, as well as being influenced by explicit scenes.\nHe pointed out examples from other film industries, like Bollywood, where romantic interactions are implied rather than explicitly depicted.\nAlso, the Kumawood actor recounted an instance when he was approached by Otumfuo Osei Tutu II, who expressed dismay over the prevalence of insults and graphic content in Ghanaian movies. \nAgya Koo stated that he has consistently advised filmmakers against such practices, fearing that it could drive audiences towards foreign productions. \nHowever, he faced opposition within the industry due to his campaign, the actor told the host of the show Kwame Dadzie.\nDespite encountering resistance, Agya Koo expressed gratitude for the support received from some filmmakers who shared his concerns. \nHe affirmed his commitment to improving the industry and called upon his colleagues to join him in advocating for more responsible content creation.",
            "images": [
                "https://www.myjoyonline.com/wp-content/uploads/2022/05/download.jpg"
            ],
            "tags": "Agya Koo, Ghanaian movies, Sex, Sex scenes",
            "source": "MyJoyOnline.com"
        },
        {
            "title": "Ghana: Invest in Developing Tech Skills of Ghanaian Youth – Dr Bawumia to Telecel Group",
            "url": "https://www.myjoyonline.com/ghana-invest-in-developing-tech-skills-of-ghanaian-youth-dr-bawumia-to-telecel-group/",
            "audio_url": "https://pubcast-files.remixd.com/audios/https___www.myjoyonline.com_ghana-invest-in-developing-tech-skills-of-ghanaian-youth-dr-bawumia-to-telecel-group?Expires=1710329562&KeyName=pubcast-files-cdn&Signature=g1OtWsNex6a4PWqy-cAZMYh1Lx0=",
            "artical_posted": "12 March 2024 2:58pm",
            "categories": "Africa",
            "content": "Vice President Mahamudu Bawumia has called on Telecommunication companies operating in the country to move beyond seeking to expand the physical infrastructure of their operations to investing in the human and other resources that are at the heart of their offerings to the Ghanaian and African market.\nSpeaking at the launch of operations for Telecel Ghana, new majority shareholders in the company formerly known as Vodafone Ghana, on Monday, March 11, 2024 Dr Bawumia reminded telcos, fintechs and stakeholders in the technology ecosystem that one of the surest ways of ensuring lasting success is investing in the youth, who are the future of any endeavor.\n“Let me challenge you to look beyond physical infrastructure. Your corporate social responsibility must include a deliberate investment and development of the digital capabilities and capacities of young Ghanaians across the country at all levels. As we celebrate this momentous occasion, remember that you also have a role in shaping the future of our nation,” he reminded them.\nDr Bawumia reminded the leadership of Telecel that innovation is the heartbeat of success in the telecom and indeed the business environment, and challenged them to make a difference in the Ghanaian telcom market with offerings that would make their brand attractive.\n“In the ever-evolving landscape of technology, innovation is key to staying ahead. Your customers require accessible, safe, affordable, and reliable network always. I am happy about Telecel’s commitment to expand their network and bring more innovation into this space. In that regard, you have the government’s firm support.\nHe continued: “I am also delighted to see the emphasis placed on inclusivity and accessibility in your services. In Ghana, like in many parts of the world, there are still underserved communities with limited access to telecommunications infrastructure. By expanding your reach and investing in infrastructure development, you are not only expanding access to communication but also creating opportunities for economic growth and social empowerment for the underprivileged.\nExtolling the virtues of the introduction and growing use of Mobile Money, Vice President Bawumia urged the management of Telecel to explore the many opportunities available for deepening financial inclusion, saying although much had been done, there was more to do.\nThe value of mobile money transactions as of December 2016 was GH¢78.5billion. However, since the introduction of Mobile Money Interoperability between different networks and bank accounts, there has been a very rapid expansion in the volume of transactions. In 2023, mobile money transactions hit a record GHC199.3 trillion, which represents 64.3% increase from the previous year. This has made Ghana the number one country in Africa for financial inclusion, because we have achieved 100% availability and inclusion for every Ghanaian. \n“The opportunities that the Mobile Money platform, backed by the introduction of Mobile Money Interoperability, has created is enormous. I commend your company for the role it has played in the past, but most importantly, I urge you to strive to do more as mobile money is one of the surest ways to promote financial inclusivity.”\nWelcoming the Telecel Group to Ghana with a hearty “Akwaaba”, Dr Bawumia urged them to be worthy partners for national development.\n“I applaud your commitment to corporate social responsibility through the Telecel Foundation and Africa Start-Up Initiative Programme (ASIP). Your initiatives to support education, healthcare, and support for start-ups reflect your dedication to making a meaningful impact beyond business success. This aligns perfectly with our government's vision of building a more equitable and prosperous society for all Ghanaians.\n“As key players in the telecommunications industry, I urge you to uphold the highest standards of ethics, transparency, and corporate governance in all your endeavours. I have no doubt that this brand will not only thrive but also contribute significantly to the advancement of our nation's telecommunications sector.”\nTelecel Group\nThe Telecel Group acquired Vodafone International’s 70% stake in Ghana Telecom in February 2023, with the Government of Ghana retaining its 30% stake. The two organisations have since been working to synergize their operations, with changes in leadership and operations. Patricia Obo-Nai, first Ghanaian CEO of Vodafone Ghana, has been tapped as the first CEO of Telecel Ghana.\nOperating in over 27 countries, with over six million active subscribers, Telecel aims to digitally empower Africa through technology, connecting remote areas for inclusivity, and focusing on education as a catalyst for growth and accessibility, according to its Board.\nSpeaking at the launch, the Chairman and Co-founder of the Telecel Group, Mr. Nicolas Bourg, said the company intends to focus on “positive disruption and innovation in the Ghanaian telecoms market,” adding “we chose to invest in Ghana because of the manifest potential of the youth and people of Ghana.”\nDistributed by APO Group on behalf of The Presidency, Republic of Ghana.",
            "images": [
                ""
            ],
            "tags": "",
            "source": ""
        },
        {
            "title": "Putting Ghana first Tullow’s local content success story",
            "url": "https://www.myjoyonline.com/putting-ghana-first-tullows-local-content-success-story/",
            "audio_url": "https://pubcast-files.remixd.com/audios/https___www.myjoyonline.com_putting-ghana-first-tullows-local-content-success-story?Expires=1710329563&KeyName=pubcast-files-cdn&Signature=XItuG2jkm_FDqYLc7K5veOoGtyA=",
            "artical_posted": "12 March 2024 3:20pm",
            "categories": "Opinion",
            "content": "It is always a sight for sore eyes on the offshore assets of Tullow Ghana, in West Africa.\nBeyond the impressive facilities on the FPSOs that produce oil and gas, the most fascinating scene is the strong commitment to local talent and expertise in action. What is often noticeable is that amidst the varying sounds of large-scale equipment and the lingering breeze from the ocean, Ghanaian workers stand shoulder-to-shoulder with their international counterparts, united in their pursuit of excellence.\nAs the global energy demand continues to rise, the role of multinational corporations in shaping the future of oil and gas production cannot be overstated. In Ghana, the emergence of the oil boom close to two decades ago presented both opportunities and challenges. Amidst all these, Tullow Ghana, the main operator of the Jubilee and TEN fields, emerged as a pioneer in promoting local content development, in line with the demands of the petroleum agreement with its host nation.\nSince 2007, Tullow Ghana Limited recognised that sustainable development must match community engagement and empowerment. This led to an active implementation of a solid local content strategy that aimed to maximize the participation of Ghanaians in the upstream sector. Today, this success story continues to be told in transformative ways.\nFor example, more than 70% of Tullow’s workforce for its Ghana operations are locals with 32% ($202m) of the total value of contracts ($619m) awarded in 2023 going to indigenous entities (a 4% increase from 2022). Additionally, $317m worth of contracts were awarded to Joint-Venture companies (part Ghanaian and part foreign ownership) that same year.\nOver the past decade, Tullow has awarded contracts worth $10.7 billion to businesses with significant local participation in the sector.\nAnd that is not all: The company delivered six training workshops through the Petroleum Commission/Tullow Business Academy Partnership initiative last year, strengthening its ties with key external stakeholders. A strong commitment to transparency and collaboration was demonstrated through the successful organisation of four Supplier Market Day events, and the completion of five supplier training programmes across the country. \nA significant milestone in Tullow’s commitment to ethical practices also reflected in the training of 140 suppliers late last year on the importance of safeguarding human rights within the supply chain sector,\n“Our commitment to local content reflects the way we do business in Ghana. Since its inception, Tullow and its partners have delivered close to $7bn in revenues to the Ghana government and invested close to $20bn in the oil and gas sector. Given a consistent enabling environment and respect for the sanctity of contracts and agreements by our host nation, more can be done to make this country an energy sector leader in West Africa,” said Managing Director, Wissam Al-Monthiry.\nTullow Ghana’s intent extends beyond using only local resources, it also strives to build local capability through education, knowledge, and skills transfer. This ensures that the benefits of natural resource development are enjoyed by local communities. In the key parts of Ghana, especially the Western region where its major operations are, Tullow continues to support the local communities through educational infrastructure for secondary schools, scholarships for disadvantaged students and livelihood programmes for the fisherfolk. It is currently investing over $10m in educational infrastructure in key regions in Ghana; making dreams come true for the people.\nLet’s zoom in on Tullow’s recent Jubilee South-East (JSE) Project as another example. This project expanded oil production capacity from 70,000 to 100,000 barrels per day in the Greater Jubilee Field. During the project, it became evident that a local company, Orsam Energies (with a 90% Ghanaian workforce), successfully fabricated one of the world's most complicated subsea equipment for the project at its fabrication yard in Takoradi; a triumph for local capacity development.\nSometime in 2021 as well, Tullow, in true local content fashion, supported and enabled the delivery of Ghana’s first ever wholly-owned sea vessel - the \nMV Flat Confidence\n - which currently supports two FPSO (Floating Production Storage Offloading) assets offshore Ghana. Tullow’s leadership in awarding a contract to Flat C Marine Services – the owners of the Ghanaian-owned vessel - highlighted the potential of local businesses to thrive in the oil and gas sector, when given the right support.\nAs Ghana continues to navigate the complexities of oil and gas production, the leadership demonstrated by Tullow Ghana Limited in local content development is a blueprint for other industry players to emulate. By making Ghanaians the priority in its operations, Tullow has laid the foundation for a more inclusive and sustainable future. There is more to come.                                                                                 ",
            "images": [
                "https://www.myjoyonline.com/wp-content/uploads/2024/03/image-234-636x424.png",
                "https://www.myjoyonline.com/wp-content/uploads/2024/03/image-235-1024x683.png",
                "https://www.myjoyonline.com/wp-content/uploads/2024/03/image-234-1024x683.png"
            ],
            "tags": "Tullow",
            "source": "Tullow"
        },
        {
            "title": "Ghana Society of Agribusiness Scientists formed to promote innovation and research",
            "url": "https://www.myjoyonline.com/ghana-society-of-agribusiness-scientists-formed-to-promote-innovation-and-research/",
            "audio_url": "https://pubcast-files.remixd.com/audios/https___www.myjoyonline.com_ghana-society-of-agribusiness-scientists-formed-to-promote-innovation-and-research?Expires=1710329563&KeyName=pubcast-files-cdn&Signature=__Pcs_8A_Nxg_Uk_uyLlIQjq_ZE=",
            "artical_posted": "12 March 2024 6:38pm",
            "categories": "Agribusiness | Economy",
            "content": "Agribusiness scientists in Ghana have bemoaned what they call ‘encroachment and dilution’ of the agribusiness practice in Ghana.\nGhana Society of Agribusiness Scientists (GSAS), Prof Richard Kwasi Bannor, points out the situation has led to mismanagement of the sector.\nAt the launch of the organization in Kumasi, Prof. Bannor justified the need for a recognized agribusiness body of scholars to avert the situation.\n“Encroachment seems quite comfortable because of agribusiness's interdisciplinary nature, the mismatch between industry needs and supply, and the non-existence of societies like GSAS, whose continuous engagement with industry can improve the status quo. So, for instance, it is pervasive to find firms in Ghana’s financial sector giving away jobs usually seeded to agribusiness experts to others with no background in the discipline but would later turn to development partners to train these same employees on how to identify agricultural risks and develop innovative products that lessen risks associated with lending to the sector. I must quickly add that this square-pegs-in-round-holes situation also happens in other sub-sectors that thrive on agribusiness expertise.\n“But who is better placed to understand and manage the problems and risk factors in the agricultural sector than the agribusiness professional with accumulated theoretical and specialist knowledge?” he said.\nThe virtual launch was under the theme: “Re-defining agribusiness education, research and innovation”.\nIt was attended by representatives of organisations and groups such as Kosmos Innovation Center, Ghana Association of Agricultural Economists (GAAE), International Food and Agribusiness Management (IFAMA) among others.\nHead of KNUST department of agriculture economics, agribusiness and extension, Prof. Fred Nimoh who represented the provost of the KNUST College of Agriculture and Natural Resources charged the organization to churn out innovations to drive the agriculture value chain.\n“Along the chain we should be able to think through and come out with innovations and address the challenges.\n“And we all believe, we’re going to experience a drastic change,” he’s optimistic.",
            "images": [
                "https://www.myjoyonline.com/wp-content/uploads/2024/03/6W0A0088X-636x424.jpg"
            ],
            "tags": "Ghana Society of Agribusiness Scientists",
            "source": "Emmanuel Kwasi Debrah"
        },
        {
            "title": "Telecel brand officially launched in Ghana",
            "url": "https://www.myjoyonline.com/telecel-brand-officially-launched-in-ghana/",
            "audio_url": "https://pubcast-files.remixd.com/audios/https___www.myjoyonline.com_telecel-brand-officially-launched-in-ghana?Expires=1710329564&KeyName=pubcast-files-cdn&Signature=_qqzrhNQ83EG8OsVmDpo3Abvc6c=",
            "artical_posted": "12 March 2024 3:32pm",
            "categories": "",
            "content": "Telecel, a leading telecommunications brand in Africa, has officially launched in Ghana to provide innovative telecommunications solutions to connect and empower customers and communities across Ghana. \nIn February 2023, Telecel Group completed the acquisition of 70% shares of Ghana Telecommunications Company Limited (GTCL) to become its majority shareholder. \nWithin a year, the company has fully rebranded from Vodafone Ghana to Telecel Ghana.\nThe brand was first unveiled to employees at an event dubbed 'Telecel Day' at the Accra International Conference Centre.\nAt a second ceremony held at the Labadi Beach Hotel, the Vice President, Dr Mahamudu Bawumia unveiled the Telecel brand in the presence of a cross-section of stakeholders including government and community representatives, media, industry leaders and customers. \nThe event, dubbed Platinum Night was an exclusive high-level event which offered the opportunity to senior stakeholders to know the brand.\nAs the special guest of honour at the event, Dr. Bawumia underscored the importance of telecommunications in today’s economy. \nHe said, “Telecommunication plays a pivotal role in shaping our modern society. It bridges distances, connects people, and empowers communities. \n\"In today's fast-paced world, access to reliable and efficient communication is not just a luxury but a necessity for socioeconomic development. \n\"It is also critical to Ghana’s digitisation agenda, and I am particularly pleased that Telecel Group has decided to invest in Ghana.\n\"I believe it is a testament to the conducive business environment created by deliberate and intentional policies by the Nana Akufo-Addo government.”\nThe final and big reveal was held at the Tetteh Quarshie Interchange amid exciting performances and solidarity messages from key stakeholders such as the Member of Parliament of Ayawaso West Wuogon, Hon. Lydia Seyram Alhassan.\nTelecel’s vision is to lead Africa's digital revolution, connecting communities with sustainable and locally developed innovative connectivity methods, and inspiring technological advancements that pave the way for a thriving, interconnected continent. \nIn Ghana, Telecel is focusing on significantly expanding its network coverage, aiming for 2500 4G sites within three years and targeting 100% satellite-to-mobile connectivity to ensure nationwide access across Ghana.\nSpeaking at the brand unveil, the CEO of Telecel Group Moh Damush said, “We are thrilled to announce the launch of Telecel brand in Ghana, marking a significant milestone for Telecel and an opportunity to provide positive disruption, advancement, and innovation in Ghana. \n\"Telecel Group promises to put its heart and soul into the company, which is and will continue to be the flagship of Telecel in West Africa. As of today, Vodafone Ghana has become Telecel Ghana.\nWhatever the brand is, the origin will stay Ghana Telecommunication Company.”\nTelecel Ghana offers a wide range of telecommunications services, including mobile voice and data, broadband internet, mobile money, and value-added services. \nWith a focus on innovation and customer satisfaction, Telecel Ghana is committed to empowering individuals, businesses, and communities with seamless and reliable connectivity to thrive in today’s digital world.\nPatricia Obo-Nai, CEO of Telecel Ghana said \"Our business has evolved from offering basic telecommunication services to pioneering digital solutions across Ghana. \nThis evolution was powered by our belief in innovation, commitment to excellence, and the vision to create a connected and empowered Ghana. We look forward to an exciting journey.”\nWith the change in the brand name, the other two subsidiaries of the company have also changed to Telecel Cash and Telecel Foundation. \nAll areas of operations have changed to Telecel, and customers will continue to enjoy the existing services on their 020 and 050 numbers",
            "images": [
                "https://www.myjoyonline.com/wp-content/uploads/2024/03/image-237-636x424.png",
                "https://www.myjoyonline.com/wp-content/uploads/2024/03/image-237-1024x683.png",
                "https://www.myjoyonline.com/wp-content/uploads/2024/03/image-236-1024x683.png"
            ],
            "tags": "Telecel",
            "source": ""
        },
        {
            "title": "African Games 2023: Ghana secures quarter final berth in men and women’s beach volleyball",
            "url": "https://www.myjoyonline.com/african-games-2023-ghana-secure-quarter-final-berth-in-men-and-womens-beach-volleyball/",
            "audio_url": "https://pubcast-files.remixd.com/audios/https___www.myjoyonline.com_african-games-2023-ghana-secure-quarter-final-berth-in-men-and-womens-beach-volleyball?Expires=1710329564&KeyName=pubcast-files-cdn&Signature=0PQfEfEON3peZBf6VgzL66Reex4=",
            "artical_posted": "12 March 2024 5:08pm",
            "categories": "Other Sports",
            "content": "Ghana has qualified to the quarter final stage of the men's volleyball competition after a 2-1 win over Algeria.\nGhana's impressive pairing of Paul Akan and Seidu Agyinaku rallied back from a difficult second set to take the decisive third set.\nTuesday's win is Ghana's fourth consecutive win after an excellent group stage campaign.\nGhana qualified from pool F of the men's beach volleyball with a perfect score of three wins; a 2-1 win over Togo, 2-0 over Senegal and a 2-0 win over Benin.\nEarlier on Monday, the team's coach, Chapnuor Eden tasked the team to win gold by the end of the competition.\n \"We couldn't win gold at the last tournament we hosted here; the Commonwealth Qualifiers.For the men's side we couldn't but I'm confident we can get a gold medal in this African Games.\" He told JoySports.\nThe women's team had a more straightforward path.\nSuccessive group stage wins - 2-1 over the Gambia and 2-0 over Burkina Faso, in pool A ensured qualification to the quarter final stage.\nBoth male and female teams will learn of their quarter final opponents after tonight's draw at 6 PM. ",
            "images": [
                "https://www.myjoyonline.com/wp-content/uploads/2024/03/1000002346-565x424.jpg"
            ],
            "tags": "African Games 2023, Beach Volleyball",
            "source": "Victor Atsu Tamakloe "
        },
        {
            "title": "The Sound of Music: GIS to organise musical adaptation with a Ghanaian twist on March 19",
            "url": "https://www.myjoyonline.com/the-sound-of-music-gis-to-organise-musical-adaptation-with-a-ghanaian-twist-on-march-19/",
            "audio_url": "https://pubcast-files.remixd.com/audios/https___www.myjoyonline.com_the-sound-of-music-gis-to-organise-musical-adaptation-with-a-ghanaian-twist-on-march-19?Expires=1710329565&KeyName=pubcast-files-cdn&Signature=34vr82mBfN7hCGcJNzeavjBjgpY=",
            "artical_posted": "12 March 2024 6:00pm",
            "categories": "Education | National",
            "content": "The Ghana International School (GIS) has announced the commencement of its 13th musical, '\nThe Sound of Music\n,' at the National Theatre, on Tuesday, March 19.\nEmbracing a holistic approach to education, the school underscored the significance of arts and extracurricular activities alongside academic learning, and the pivotal role in child development.\nSpeaking to \nJoyNews’\n Adobea Asare, the Principal of GIS, Frank Amponsah-Mensah stressed the importance of nurturing students' talents and creativity beyond the confines of traditional education. \nHe stated that GIS aims to ensure that its students receive a complete school experience by the time they leave, stating that school curricular activities contribute to molding well-rounded students.\n“Many people will realize and understand that the school is not only about academics but also know that school curricular activities contribute to making a whole student.\n\"So these musicals are part of the offer that we have so that our students get the opportunity to be involved in these essentially non-academic aspects which actually help academics,” he said.\nMr Amponsah-Mensah emphasised that the 13th musical, ‘\nThe Sound of Music\n,’ marks the second time the school is hosting the event. He expressed hope that it is something families and all attendees will take pride in seeing again.\n“This year, we are happy to do a GIS adaptation. We sought to take it and work around it a bit, change a few of the names, the scenes and give a Ghanaian touch to it. It’s going to be interesting,” he remarked.\nProviding insights into the preparations for the upcoming musical event, the Creative Director for the school's concert, Vivian Boateng revealed that GIS is reintroducing '\nThe Sound of Music\n,' with a unique Ghanaian twist added to the performance.\nShe stated that the students have exhibited dedication and hard work to deliver a good performance at the event.\n“Ghana International School is coming back with 'The Sound of Music,' and these children and young people have worked so hard to bring you the best of the school.”\nThe students also expressed excitement about the upcoming musical and what they expect from the event.\n“We’ve been doing rehearsals since January, and the show is filled with so much music, dancing, and singing and so much acting. There’s a lot of family love and romance. We want to thank the creative director, our literature teachers for putting in so much work and effort.”\n“I expect an amazing production; we’ve all put in long hours working pretty hard, and I think we’d be quite happy with the result,” another remarked.\n'\nThe Sound of Music\n' has infused a majority of the student populace with high spirits, as they prepare and anticipate the day of the musical concert to showcase their talent and creativity.",
            "images": [
                "https://www.myjoyonline.com/wp-content/uploads/2024/03/Ghana-International-School-630x424.png"
            ],
            "tags": "Ghana International School (GIS), The Sound of Music",
            "source": "Benedicta Adobea Asare"
        },
        {
            "title": "Ghanaian born goalkeeper receives call up into Bolivian national team",
            "url": "https://www.myjoyonline.com/ghanaian-born-goalkeeper-receives-call-up-into-bolivian-national-team/",
            "audio_url": "https://pubcast-files.remixd.com/audios/https___www.myjoyonline.com_ghanaian-born-goalkeeper-receives-call-up-into-bolivian-national-team?Expires=1710329565&KeyName=pubcast-files-cdn&Signature=SxhKkMMQx8XNMrTV8GZlNuvPoUY=",
            "artical_posted": "12 March 2024 9:20pm",
            "categories": "Football",
            "content": "Ghana-born and bred goalkeeper David Akologo has been named in the Bolivian national team for this month's international friendlies.\nAkologo has consistently been one of the best shot stoppers in the Bolivian Primera Division.\nHe has been playing in Bolivia since 2018 when he first signed with Club Arauco Prado in the country's third Division.\nAkologo has since progressed steadily, earning a two-year contract with top-flight side Club Aurora in January 2023.\nA little over a year later, Akologo has now received his first national team call up After completing a nationality switch.\nIn 2021, Akologo became eligible for naturalisation after working in the country for three uninterrupted years.\nThe 27-year old is in line to make his debut when Bolivia face Algeria on Friday, March 22, 2024.\nBolivia will play Andorra three days later, on Monday, March 25, 2024.",
            "images": [
                "https://www.myjoyonline.com/wp-content/uploads/2024/03/20240312_212022-424x424.jpg"
            ],
            "tags": "Bolivian national team, goalkeeper David Akologo",
            "source": "Victor Atsu Tamakloe "
        },
        {
            "title": "IWD: Akosua Manu eulogises female inspirational leaders in Ghana",
            "url": "https://www.myjoyonline.com/iwd-akosua-manu-eulogises-female-inspirational-leaders-in-ghana/",
            "audio_url": "https://pubcast-files.remixd.com/audios/https___www.myjoyonline.com_iwd-akosua-manu-eulogises-female-inspirational-leaders-in-ghana?Expires=1710329566&KeyName=pubcast-files-cdn&Signature=SYtgdKG6j2ofP-2C2AFKTMndmg0=",
            "artical_posted": "13 March 2024 1:17am",
            "categories": "National",
            "content": "The Parliamentary Candidate for the New Patriotic Party in the Adentan Constituency, Akosua Manu has paid homage to the remarkable women who have demonstrated exemplary leadership in Ghana.\nIndicating that their unparalleled dedication and remarkable accomplishments have paved the way for a more inclusive and empowered society.\nSpeaking on International Women's Day on Metro TV's Good Morning Ghana, Akosua Manu rightly recognised the outstanding talents of Ghana's leading ladies beginning with the First Lady Rebecca Akufo-Addo, Second Lady Samira Bawumia, and Chief of staff Frema Opare have inspired countless Ghanaian women by serving as role models in their respective positions of influence.\nShe further eulogised the Minister for Communication and MP for Ablekuma West, Ursula Owusu Ekuful, Common Fund Administrator Naa Torshie, and Minister Designate for Sanitation and MP for Ayawaso West Wuogon, Lydia AlHassan, for demonstrating exceptional leadership in their areas of expertise and their commitment to improving the lives of their communities and Ghana as a whole.\nThe Parliamentary Candidate, Akosua Manu did not leave out her admiration for the Presidential Advisor on Media and Strategic Communications, Oboshie Sai-Coffie, and Elizabeth Ohene who have also left an indelible mark on Ghanaian society, enriching public discourse through their valuable insights and strategic management.\nAkosua Manu noted that these female leaders are not only symbols of inspiration but also catalysts for change.\n\"Through their initiatives and policies, they have worked tirelessly to empower women, promote gender equality, and uplift marginalized communities. Their efforts have led to increased access to education, healthcare, and economic opportunities for women across the nation.\n“It is crucial to reflect on the immense progress made towards gender equality in Ghana. The achievements of these notable women are an ode to their determination, resilience, and unwavering spirit. They have proven that gender should never be a barrier to success and have opened doors for future generations of Ghanaian women to flourish.\"",
            "images": [
                "https://www.myjoyonline.com/wp-content/uploads/2024/03/WhatsApp-Image-2024-03-13-at-02.47.16-636x424.jpeg",
                "http://www.myjoyonline.com/wp-content/uploads/2024/03/WhatsApp-Image-2024-03-12-at-12.06.21.jpeg",
                "http://www.myjoyonline.com/wp-content/uploads/2024/03/WhatsApp-Image-2024-03-12-at-11.38.03-1024x763.jpeg",
                "http://www.myjoyonline.com/wp-content/uploads/2024/03/WhatsApp-Image-2024-03-12-at-11.13.29-1024x899.jpeg"
            ],
            "tags": "Akosua Manu, Rebecca Akufo-Addo, Samira Bawumia",
            "source": ""
        },
        {
            "title": "IWD 2024: Don’t compete with men, be what you can be – IRC-WASH Ghana Country Director",
            "url": "https://www.myjoyonline.com/iwd-2024-dont-compete-with-men-be-what-you-can-be-irc-wash-ghana-country-director/",
            "audio_url": "https://pubcast-files.remixd.com/audios/https___www.myjoyonline.com_iwd-2024-dont-compete-with-men-be-what-you-can-be-irc-wash-ghana-country-director?Expires=1710329566&KeyName=pubcast-files-cdn&Signature=qOWtdm_loR2j1iIUg7xqXLY329g=",
            "artical_posted": "13 March 2024 2:20am",
            "categories": "National",
            "content": "Members of the Network of Professional Women in Water, Sanitation and Hygiene (WiWASH), have been charged by the Country Director for IRC-WASH Ghana and Board Member for Ghana Water Company Limited (GWCL), Vida Affum Duti, to refrain from undue competition with men in the pursuit of gender equality.\nAccording to her, such behaviours brew unnecessary tension between men and women and render the equality agenda counterproductive.\nMrs Duti said this while delivering her keynote address on March 8, 2024, during an event organised by WiWASH to mark International Women’s Day 2024, at the Ghana Water Company Limited Head Office in Accra. \n“A saying like “what men can do women can do better” causes unnecessary tension and competition. We need to be proud of the talents of women and what they can achieve and not use men’s achievements as the yardstick of what women can do,”she said.\nThe Country Director urged women to strive to become what they set their minds to and stop wasting their time.\nMrs Duti also advised women to guard against the popular saying that “behind every successful man is a woman” and stop being stuck in their minds to unleash their potential. \nShe noted that such sayings put women in the shadows of men and indicate their place as being behind the success of men.\n“As women, you are not only there to support the success of men, but you are also capable of achieving your own success and you are encouraged to do so”, she said.\nOther dignitaries at the event included the Managing Director of GWCL, Professor Benedicta Fosu-Mensah and Dr Rita Boateng of the University of Ghana, the General Manager for Finance and Administration and other Chief Managers of GWCL who took turns to address the women at the function.\nThe Network of Professional Women in Water, Sanitation and Hygiene, known as WiWASH, is the Ghana Chapter of the Women’s Caucus of the Africa Water and Sanitation Association (AfWASA). It is a platform for the exchange of experiences, good practices and capacity building among members, for the improvement of the water, sanitation and hygiene sector.\nWiWASH was officially launched at the Alisa Hotel in Accra Ghana on July 13, 2017.\nMembership of the Network is open to women researchers, engineers, technicians, administrative officers and all other professional women in the WASH sector.",
            "images": [
                "https://www.myjoyonline.com/wp-content/uploads/2024/03/Members-of-the-Network-of-Professional-Women-in-Water-Sanitation-and-Hygiene-2-636x424.jpg",
                "https://www.myjoyonline.com/wp-content/uploads/2024/03/Members-of-the-Network-of-Professional-Women-in-Water-Sanitation-and-Hygiene-1.jpg",
                "https://www.myjoyonline.com/wp-content/uploads/2024/03/Members-of-the-Network-of-Professional-Women-in-Water-Sanitation-and-Hygiene-3.jpg"
            ],
            "tags": "International Women Day, IRC-WASH Ghana Country Director, Vida Affum Duti",
            "source": "Mjoyonline.com"
        },
        {
            "title": "Keysoap At 60: Unilever Ghana launches “Amansan Akyede” promo to reward loyal customers",
            "url": "https://www.myjoyonline.com/keysoap-at-60-unilever-ghana-launches-amansan-akyede-promo-to-reward-loyal-customers/",
            "audio_url": "https://pubcast-files.remixd.com/audios/https___www.myjoyonline.com_keysoap-at-60-unilever-ghana-launches-amansan-akyede-promo-to-reward-loyal-customers?Expires=1710329567&KeyName=pubcast-files-cdn&Signature=5BWU8NBzhcJrx5YBIzI5UoeerUo=",
            "artical_posted": "13 March 2024 2:49am",
            "categories": "National",
            "content": "Unilever Ghana PLC, a leading brand in Ghana noted for manufacturing family care products such as Keysoap, Geisha soap, BF soap and a list of trusted detergents, has launched Keysoap at 60 “Amansan Akyede” promo to celebrate the brand’s 60 years of existence.\nKeysoap is a product that has transcended many generations, for which reason it has become imperative to recognise its loyal customers and trade partners who have supported the brand over the years, as the company celebrates the 60th anniversary of its existence.\nAs part of activities to celebrate the 60 years of the existence of Keysoap, Unilever Ghana has launched a promotion to reward its loyal customers with various products and prices including diamonds and cash prices.\nSpeaking at the forecourt of the Tema Metropolitan Assembly (TMA) where the launch took place, the Head of Corporate Branding at Unilever Ghana PLC, Theodora Kassu, said Keysoap for over sixty years, has been one of the trusted products in Ghana as it offers long-lasting laundry experiences at an affordable price.\n“As part of its efforts to reconnect to the community, Key soap is one of the most affordable soaps you can find on the Ghanaian market, and it does not hurt the hand when one uses it coupled with a unique fragrance that has lived for over 60 years, and this fragrance sets us apart from other bar soaps on the market.\nAs a brand, we don’t only want to share this milestone chalked by the brand or celebrate it internally but want our consumers to be a part of this celebration. All they need to do is look out for the 250-gram, 800 or 1000-gram with a special sticker inside the bar soap. Consumers who find the sticker automatically enter a promo to participate in the draw to win some of the prizes up for grabs during the 60th-anniversary celebration of the Keysoap brand.\"\nThe Managing Director of Unilever Ghana PLC, John Owusu Ansah described Keysoap as a historic and iconic jewel of Unilever PLC.\nHe added that the bar soap has been improved with some new features to make it more appealing to the Ghanaian market.\nHe said, “The 60th-anniversary celebration of Keysoap which is christened “Keysoap Amansan Akyede” is also to reconnect with the consumers of the product and create moments of joy and celebration”.",
            "images": [
                "https://www.myjoyonline.com/wp-content/uploads/2024/03/1-37-565x424.jpg",
                "http://www.myjoyonline.com/wp-content/uploads/2024/03/3-17-1024x768.jpg",
                "http://www.myjoyonline.com/wp-content/uploads/2024/03/4-12-1024x768.jpg",
                "http://www.myjoyonline.com/wp-content/uploads/2024/03/2-23-1024x768.jpg"
            ],
            "tags": "keysoap, Keysoap Amansan Akyede, Unilever Ghana PLC",
            "source": "Elvis Washington"
        },
        {
            "title": "Almost every leader in Ghana has integrity deficit – Michael Boadi",
            "url": "https://www.myjoyonline.com/almost-every-leader-in-ghana-has-integrity-deficit-michael-boadi/",
            "audio_url": "https://pubcast-files.remixd.com/audios/https___www.myjoyonline.com_almost-every-leader-in-ghana-has-integrity-deficit-michael-boadi?Expires=1710329567&KeyName=pubcast-files-cdn&Signature=uLoYoZdmUWroTs6UQuHvR2L08XY=",
            "artical_posted": "13 March 2024 4:45am",
            "categories": "National",
            "content": "The fundraising manager of the Ghana Integrity Initiative (GII), Michael Boadi says that almost every Ghanaian leader lacks integrity.\nAccording to him, most Ghanaian leaders have failed to fulfil promises made to the people once they win their elections.\nSpeaking on\n JoyNews\n on Tuesday, March 12, he said that “people (politicians) have not stuck to their social contracts with the people. People have promised that they will fight corruption but they leave power with corruption worsening. They promised they are going to do a lot of things but have not delivered.”\nMr Boadi stated that Ghanaians vote for leaders who consistently fail to deliver on their promises and demonstrate integrity in their actions.\n“It is not much about what you say. It is a lot about what you do after you’ve said what you’The fundraising manager of the Ghana Integrity Initiative (GII), Michael Boadi says that almost every Ghanaian leader lacks integrity.ve said. I think we should not play with words. Ghanaians are not very happy with the governance of our society. Words and deception will not get anybody the power they deserve,” he said.\nAccording to Mr. Boadi, honesty is the best and Ghanaians are looking for integrity and principled leaders.\n“People judge people. Posterity judges people. It is not so much about just winning the power but it is about what you do with the power,\" he said.\n\"We are so fixated on winning political power, we plan very little about what we will do with the power after we have won the power and that is why people will make promises, people will deceive. People will use rhetoric and words to win the power,” Mr Boadi added.\nAccording to him, collective action must be implemented and Ghanaians must unite to find solutions to the country's problems.\nHe urged Ghanaians to work together to select leaders who possess the qualities necessary to implement the solutions they have identified.\n\"Currently, the promises, the name-calling and the lies and the half-truths are not bringing us any joy. We have seen it in about five governments and it hasn’t changed our situation in Ghana,” he said.\nMr. Boadi stated that the truth should come from Ghanaians and not anyone who wants to win political power. \n“Let whoever comes to power rally the truth from the people, not the truth from his or her perspective,\" he stated.",
            "images": [
                "https://www.myjoyonline.com/wp-content/uploads/2024/03/michael-boadi-GII.jpg"
            ],
            "tags": "Ghana Integrity Initiative (GII), Michael Boadi",
            "source": "Emmanuella Sarfo-Ntow"
        },
        {
            "title": "British High Commissioner commends Ghana’s efforts in addressing deforestation challenges",
            "url": "https://www.myjoyonline.com/british-high-commissioner-commends-ghanas-efforts-in-addressing-deforestation-challenges/",
            "audio_url": "https://pubcast-files.remixd.com/audios/https___www.myjoyonline.com_british-high-commissioner-commends-ghanas-efforts-in-addressing-deforestation-challenges?Expires=1710329568&KeyName=pubcast-files-cdn&Signature=-5dsceo3sQHRsPhzjbx9UCPdp1k=",
            "artical_posted": "13 March 2024 6:12am",
            "categories": "National",
            "content": "British High Commissioner Harriet Thompson has praised Ghana's efforts in tackling deforestation, enhancing cocoa sector sustainability, and improving community livelihoods.\nSpeaking in Accra on Monday, she highlighted the partnership between the two countries, exemplified by initiatives like the Cocoa and Forest Initiative Frameworks for Action. \nShe emphasised their shared commitment to a sustainable future.\nDuring a flag-raising ceremony at the Forecourt of the State House to mark Commonwealth Day, Thompson reiterated London and Accra's dedication to ensuring peaceful general elections in Ghana in December.\nThe event, themed \"One Resilient Common Future,\" underscored the importance of Commonwealth member countries collaborating to build resilience, unlock potential, and leverage the Commonwealth Advantage.\nThompson noted that the theme reaffirmed the Commonwealth's commitment to overcoming challenges and seizing opportunities together, leveraging their strong bonds.\nCommonwealth Day, celebrated on the second Monday of March each year, is dedicated to honouring the Commonwealth of Nations and its 56 member states.\nThompson emphasized the core values of democracy, respect for diversity, human rights, the rule of law, and sustainable development within the Commonwealth family.\nShe concluded, \"It is an honour to join you today as we proudly raise the Commonwealth flag in Ghana and around the world to reflect our shared heritage and collective achievements.\" \nTo mark the day, Thompson and Mr. Ampratum-Sarpong planted tree seedlings.",
            "images": [
                "https://www.myjoyonline.com/wp-content/uploads/2024/03/Politics-British-Commissioner-1-636x424.jpg"
            ],
            "tags": "British High Commissioner, Ghana",
            "source": "Myjoyonline.com"
        },
        {
            "title": "Ghanaians want something new; Alan Kyerematen is the best candidate – MFC Communications Director",
            "url": "https://www.myjoyonline.com/ghanaians-want-something-new-alan-kyerematen-is-the-best-candidate-mfc-communications-director/",
            "audio_url": "https://pubcast-files.remixd.com/audios/https___www.myjoyonline.com_ghanaians-want-something-new-alan-kyerematen-is-the-best-candidate-mfc-communications-director?Expires=1710329568&KeyName=pubcast-files-cdn&Signature=9MJY64R5uDgzHa8TBNOy0Mwfc18=",
            "artical_posted": "13 March 2024 6:55am",
            "categories": "Politics",
            "content": "The Director of Communications for the Movement for Change (MFC), Courage Nobi, has touted Alan John Kyerematen as the best candidate to be elected president in the upcoming 2024 general elections.\nAccording to him, Alan Kyerematen is set to bring about substantial changes for the country. Additionally, being an honest man, the Movement for Change boss is the best-suited person to lead Ghana.\nIn an interview with \nJoyNews \non March 12, Mr Nobi said; “We are at a point in our democratic dispensation where the Ghanaian people want something new.\"\nMr. Nobi emphasised that Ghanaians are looking for an individual with a proven track record of honesty and integrity in public service.\nHe emphasised that the Alan Movement has been remarkably robust, adding \"some believed it was not possible, thinking it wouldn't last two weeks, but here we are after six months.\"\n “We were in the Volta Region just yesterday, it’s exciting to see Ghanaians with so much enthusiasm about a third force...so much enthusiasm about a leader they know they can trust, that is why it is possible,\" Mr Nobi said.\nHe stressed that the movement's core objective is transformation, highlighting Alan Kyerematen's commitment to turning Ghana into a more prosperous nation.\n“Politics and governance should lead to transformation in the lives of the people, in the infrastructure they live by and in the environment that they dwell in. He (Alan Kyeremateng) has what he calls a great transformational plan, he has been at the frontline of politics for almost 40 years.\"\n\"In that period he has learnt something and gained some insights into the way our countries run. With all of that knowledge, this is the plan he will use to develop this space and transform it into a modern state should he be given the opportunity,\" the MoF Communications Director added.\nMr Nobi reiterated that each statement from Alan Kyerematen to the populace is backed by a well-crafted plan with every demographic in mind when it comes to development.",
            "images": [
                "https://www.myjoyonline.com/wp-content/uploads/2023/10/Alan-Kyerematen1-628x424.jpg"
            ],
            "tags": "Alan Kyerematen",
            "source": "Mavis Sekyibea Addo"
        },
        {
            "title": "We’ll only roll it out when Ghanaians are satisfied – EC justifies U-turn on Ghana Card use",
            "url": "https://www.myjoyonline.com/well-only-roll-it-out-when-ghanaians-are-satisfied-ec-justifies-u-turn-on-ghana-card-use/",
            "audio_url": "https://pubcast-files.remixd.com/audios/https___www.myjoyonline.com_well-only-roll-it-out-when-ghanaians-are-satisfied-ec-justifies-u-turn-on-ghana-card-use?Expires=1710329569&KeyName=pubcast-files-cdn&Signature=tFxGGwAJW3QPnALlqYirX_79_Vo=",
            "artical_posted": "13 March 2024 8:04am",
            "categories": "National",
            "content": "The Electoral Commission (EC) is clarifying its decision to back down on plans to use the Ghana Card as the sole identification document for the upcoming general election. \nThe EC’s Director of Electoral Services, Dr Serebour Quaicoe, says it will only be reconsidered when Ghanaians are fully satisfied with the prospects.\nThe existing C.I. 126, which was passed by Parliament ahead of the 2020 General Election, recognises the use of the passport and the guarantor system as valid means for new registrants to prove their identity as Ghanaians.a\nThe EC’s decision to maintain C.I. 126 also means that the guarantor system, which the Commission had intended to abolish in subsequent registration exercises, would be applicable to new registrants.\nThese were some major fallouts of an Inter-Party Advisory Committee (IPAC) meeting held in Accra on Thursday, March 7, chaired by Jean Mensa, Chairperson of the EC.\nOne of the major concerns for Ghanaians was the fear that all Ghanaians have their Ghana Cards which may lead to disenfranchisement.\nIn an interview with \nJoyNews\n, he explained that the EC will only reintroduce the legislation when there is consensus on the matter.\n\"Anybody in the commission, who appreciates the system will want us to roll controls out the continuous registration and the continuous registration is contingent on the use of the Ghana Card,\" he said on PM Express.\nAccording to Dr. Serebour Quaicoe, \"Anytime that Ghanaians are satisfied that a lot of the Ghana Cards have been produced and almost everybody has gotten it, it will be rolled out because that is what we will be happy rolling out with the continuous registration.\n\"So for 2024, it will not [be used] but it is not dead.\"\nRepresentatives of the two major political parties – the New Patriotic Party (NPP), and the National Democratic Congress (NDC) – told journalists after the March 7 meeting that the EC had also rescinded its decision to abolish the use of indelible ink in the 2024 Election.\nThe parties said the EC also agreed to extend the next limited voters registration exercise beyond its district offices to cover electoral areas that are 'hard to reach'.\nThe Commission is said to have announced the creation of 4,000 more polling stations in addition to the over 38,000 existing polling stations for the 2024 General Election.\nThe EC also tabled its calendar for the 2024 Election and granted the parties the opportunity to make input.",
            "images": [
                "https://www.myjoyonline.com/wp-content/uploads/2020/04/Ghana-Card-631x424.jpg"
            ],
            "tags": "Election, Electoral Commission, Ghana Card",
            "source": "Myjoyonline.com"
        },
        {
            "title": "African Games: Ghana to face Morocco (men’s team), Mozambique (women’s team) in beach volleyball quarter finals",
            "url": "https://www.myjoyonline.com/african-games-ghana-to-face-morocco-mozambique-in-beach-volleyball-quarter-finals/",
            "audio_url": "https://pubcast-files.remixd.com/audios/https___www.myjoyonline.com_african-games-ghana-to-face-morocco-mozambique-in-beach-volleyball-quarter-finals?Expires=1710329570&KeyName=pubcast-files-cdn&Signature=yCdgciP8Lh7ctlqxUswfW4h0sLA=",
            "artical_posted": "13 March 2024 8:28am",
            "categories": "Other Sports",
            "content": "The beach volleyball competition of the 13th African Games enters the quarter final stage today.\nGhana's men's team will face Morocco at 10 AM at the Laboma Beach.Ghana have so far won all four matches in the competition.\nWins against Togo (2-1), Senegal (2-0), and Benin (2-0) ensured a smooth path to the round of twelve in the competition.\nA 2-1 win over Algeria on Tuesday secured Ghana's ticket to the quarter final stage.\nKenya, Africa's number one ranked team, also 21st in the world, will play South Africa in the first quarter final match on Wednesday at 9 AM.\nSenegal and Sierra Leone will face off in the other quarter final tie scheduled for 9AM.\nMozambique play Botswana.\nAt 11 AM, Ghana will face Mozambique in the women's quarter final.\nAlthough Ghana have missed the services of Rashaka Katadat, one half of the pair that qualified Ghana for the Commonwealth Games, the team has looked quite competitive.\nHer partner from 2022, Corporal Juliana Aryee, has teamed up with Lance Corporal Charity Torku.\nCongo will face Algeria in Court Two, while Ghana's match takes place in Court One.\nIn the other quarter final fixtures, Morocco will face Rwanda, while Kenya face Egypt.",
            "images": [
                "https://www.myjoyonline.com/wp-content/uploads/2024/03/1000002346-565x424.jpg"
            ],
            "tags": "African Games 2023, Beach Volleyball",
            "source": "Victor Atsu Tamakloe "
        },
        {
            "title": "2023 African Games: Ghana wins nine medals in mixed martial arts",
            "url": "https://www.myjoyonline.com/2023-african-games-ghana-wins-nine-medals-in-mixed-martial-arts/",
            "audio_url": "https://pubcast-files.remixd.com/audios/notifications/processing-eng?Expires=1710329570&KeyName=pubcast-files-cdn&Signature=GrYzrChzP0YE4bTf03rx0Fd3xw8=",
            "artical_posted": "13 March 2024 10:29am",
            "categories": "Other Sports",
            "content": "Team Ghana has won nine medals in mixed martial arts at the ongoing 2023 African Games in Ghana.\nGhana’s representatives scooped one goal, three silvers and five bronze across various categories.\nThe five medals will not be counted as part of Ghana’s official medal tally for the 13th African Games because mixed martial arts is a demonstration sport.\nDemonstration sports are included in the games to promote them but medals awarded will not counted as part of the official table.\nGhana has five medals so far from two athletes – Winnifred Ntumi who picked a gold and two silvers from weightlifting while Abeku Jackson also won two silvers from swimming.",
            "images": [
                "https://www.myjoyonline.com/wp-content/uploads/2024/03/mixed-martial-arts-754x424.jpg"
            ],
            "tags": "Mixed martial arts",
            "source": "Joy Sports"
        },
        {
            "title": "Coalition of La Associations calls out Ghana Armed Forces over La lands",
            "url": "https://www.myjoyonline.com/coalition-of-la-associations-calls-out-ghana-armed-forces-over-la-lands/",
            "audio_url": "https://pubcast-files.remixd.com/audios/notifications/processing-eng?Expires=1710329571&KeyName=pubcast-files-cdn&Signature=UNgDydYTu-OgGEpCS-etPKaJSMQ=",
            "artical_posted": "13 March 2024 9:21am",
            "categories": "In Focus | National | Newsletter",
            "content": "The Coalition of La Associations (COLA) is not pleased with the Ghana Armed Forces' stance regarding the land issues around Kpeletso/East Airport, La in Accra. \nAccording to the Coalition, the Ghana Armed Forces' response on September 26, 2023, is unfortunate.\nThe Ghana Armed Forces' earlier communique was in response to media reports following customary rites performed on a parcel of land measuring approximately 114.52 acres in the said area.\nThe military expressed concern, stating that they had not received directives from the Ministry of Defense or any government agency permitting access to the La Stool, thereby refuting claims made by the La Traditional Council.\nBut six months on, COLA is fighting back against these claims. \nIn a fresh rebuttal, the Coalition has cited a detailed history of land ownership and negotiations dating back to government acquisitions between 1936-1944.\nThey highlighted a petition sent by the La Stool to the Ministry of Lands and Natural Resources and the Lands Commission seeking the release of a portion of the land acquired by the government.\nFurthermore, COLA underscored the formation of a committee involving various stakeholders, including the Ghana Armed Forces, which concluded its work in 2022.\nThis committee recommended terms of land allocation, leading to the signing of a Memorandum of Understanding in December 2022 and subsequent demarcation of boundaries in May 2023.\n\"The Committee therefore completed its work and is defunct as at the time of the Press Release by the Military. It could not have been true, as stated in the Press Release from the Ghana Armed Forces, that 'there are ongoing discussions by a Committee set up by the Ministry of Lands and Natural Resources to deliberate and recommend possible measures to resolve the fond issue.\"\nOn the back of this, the coalition is accusing the Ghana Armed Forces of disregarding established agreements and acting in bad faith by feigning ignorance of these negotiations.\n\"The Ghana Armed Forces cannot pretend not to be aware of the deliberations and documentation executed in respect of the land,\" Portions of the March 13, 2024 statement indicated read.\nThey emphasised the importance of respecting the rights of the La Stool for peaceful coexistence and called for adherence to the law in resolving the ongoing land dispute.\nCOLA expects the Ghana Armed Forces will act fairly and in accordance with the law.\nThey insisted that any action to the contrary would be deemed unlawful and could lead to chaos.",
            "images": [
                "https://www.myjoyonline.com/wp-content/uploads/2024/03/image-254-676x424.png"
            ],
            "tags": "Coalition of La Associations, lands",
            "source": "Myjoyonline.com"
        },
        {
            "title": "You have great advantage in any male-dominated industry – Zonda Tec Ghana CEO challenges women",
            "url": "https://www.myjoyonline.com/you-have-great-advantage-in-any-male-dominated-industry-zonda-tec-ghana-ceo-challenges-women/",
            "audio_url": "https://pubcast-files.remixd.com/audios/https___www.myjoyonline.com_you-have-great-advantage-in-any-male-dominated-industry-zonda-tec-ghana-ceo-challenges-women?Expires=1710329572&KeyName=pubcast-files-cdn&Signature=BYtUKrtoMR8SBQsvybhNTEnB6rU=",
            "artical_posted": "12 March 2024 10:08pm",
            "categories": "National",
            "content": "The Chief Executive of Zonda Tec Ghana Limited and Sinotruk, Yang Yang, has challenged women, especially Ghanaian women, to work hard and become the spirit that drives the man, the family and the nation forward.\nMrs. Yang Yang was speaking in a short video to women to mark this year’s International Women’s Day, where she averred that Ghanaian women have advantage in several industry and since industries in Ghana are male-dominated, women who are determined are given the necessary push to succeed.\nShe gave herself as an example when she indicated that in the industry she operates, being a male-dominated industry, most of the customers decided to associate with her seeing a woman doing such a great job.\n“They have sympathy in me, they appreciate my work, they give me more business, so I am so blessed being a woman, determined to work irrespective of the obstacles,” she said.\nYang Yang also advised women never to think of themselves as a mere woman or just a woman but regard themselves as entrepreneurs and be counted among the lot who are changing lives.\nAccording to her, there is not need for woman to be attending so many social activities because, as an entrepreneur, attending such activities will rob you of the ability to think and to make informed decisions.\n“If you really want to do a great job, don’t go into too many social activities, I seldom attend social activities. Once you have set this goal you need to know the rules,” she added.\nShe also said: “If don’t attend so many social activities, you can do lots of thinking, you can think through and make decisions that will propel your business, and do your planning inside and set your agenda.”\nShe said women must also not lose sight of the fact that they are not just women but mothers, and for that matter must strive to be that good woman for the family, and for that man to lean on and ensure progress and make the family prosperous.",
            "images": [
                "https://www.myjoyonline.com/wp-content/uploads/2022/02/Zondatec-754x424.jpeg"
            ],
            "tags": "Women, Zonda Tec Ghana",
            "source": "GNA"
        }
    ]
}